class mhw_vdbox_mfx_g9_skl {
	struct MFX_QM_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Avc:2;                /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj0;                                          /*     0     4 */
			struct {
				uint32_t           Mpeg2:2;              /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj1;                                          /*     0     4 */
			struct {
				uint32_t           Jpeg:2;               /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj2;                                          /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Avc:2;                /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj0;                                  /*     4     4 */
			struct {
				uint32_t   Mpeg2:2;              /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj1;                                  /*     4     4 */
			struct {
				uint32_t   Jpeg:2;               /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj2;                                  /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   ForwardQuantizerMatrix[16]; /*     8    64 */
		void MFX_QM_STATE_CMD(class MFX_QM_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 18;   /*     0     0 */
		static const size_t               byteSize = 72; /*     0     0 */

		/* size: 72, cachelines: 2, members: 3, static members: 2 */
		/* last cacheline: 8 bytes */
	};

	struct MFX_FQM_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Avc:2;                /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj0;                                          /*     0     4 */
			struct {
				uint32_t           Mpeg2:2;              /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj1;                                          /*     0     4 */
			struct {
				uint32_t           Jpeg:2;               /*     0: 0  4 */
				uint32_t           Reserved34:30;        /*     0: 2  4 */
			} Obj2;                                          /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Avc:2;                /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj0;                                  /*     4     4 */
			struct {
				uint32_t   Mpeg2:2;              /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj1;                                  /*     4     4 */
			struct {
				uint32_t   Jpeg:2;               /*     4: 0  4 */
				uint32_t   Reserved34:30;        /*     4: 2  4 */
			} Obj2;                                  /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   ForwardQuantizerMatrix[32]; /*     8   128 */
		void MFX_FQM_STATE_CMD(class MFX_FQM_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 34;   /*     0     0 */
		static const size_t               byteSize = 136; /*     0     0 */

		/* size: 136, cachelines: 3, members: 3, static members: 2 */
		/* last cacheline: 8 bytes */
	};

	struct MFX_PIPE_MODE_SELECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           Subopb:5;             /*     0:16  4 */
				uint32_t           Subopa:3;             /*     0:21  4 */
				uint32_t           Opcode:3;             /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           StandardSelect:4;     /*     0: 0  4 */
				uint32_t           CodecSelect:1;        /*     0: 4  4 */
				uint32_t           StitchMode:1;         /*     0: 5  4 */
				uint32_t           FrameStatisticsStreamoutEnable:1; /*     0: 6  4 */
				uint32_t           ScaledSurfaceEnable:1; /*     0: 7  4 */
				uint32_t           PreDeblockingOutputEnablePredeblockoutenable:1; /*     0: 8  4 */
				uint32_t           PostDeblockingOutputEnablePostdeblockoutenable:1; /*     0: 9  4 */
				uint32_t           StreamOutEnable:1;    /*     0:10  4 */
				uint32_t           PicErrorStatusReportEnable:1; /*     0:11  4 */
				uint32_t           DeblockerStreamOutEnable:1; /*     0:12  4 */
				uint32_t           VdencMode:1;          /*     0:13  4 */
				uint32_t           StandaloneVdencModeEnable:1; /*     0:14  4 */
				uint32_t           DecoderModeSelect:2;  /*     0:15  4 */
				uint32_t           DecoderShortFormatMode:1; /*     0:17  4 */
				uint32_t           ExtendedStreamOutEnable:1; /*     0:18  4 */
				uint32_t           Reserved51:13;        /*     0:19  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved64:3;         /*     0: 0  4 */
				uint32_t           VdsIldbCalculation:1; /*     0: 3  4 */
				uint32_t           Reserved68:2;         /*     0: 4  4 */
				uint32_t           ClockGateEnableAtSliceLevel:1; /*     0: 6  4 */
				uint32_t           Reserved71:3;         /*     0: 7  4 */
				uint32_t           MpcPref08X8DisableFlagDefault0:1; /*     0:10  4 */
				uint32_t           Reserved75:3;         /*     0:11  4 */
				uint32_t           Vlf720IOddHeightInVc1Mode:1; /*     0:14  4 */
				uint32_t           Reserved79:12;        /*     0:15  4 */
				uint32_t           VmbSvcTlbDummyFetchDisableForPerformance:1; /*     0:27  4 */
				uint32_t           VmbSvcMvReplicationFor8X8EnableErrorHandling:1; /*     0:28  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PicStatusErrorReportId; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128;          /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   Subopb:5;             /*     0:16  4 */
				uint32_t   Subopa:3;             /*     0:21  4 */
				uint32_t   Opcode:3;             /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   StandardSelect:4;     /*     4: 0  4 */
				uint32_t   CodecSelect:1;        /*     4: 4  4 */
				uint32_t   StitchMode:1;         /*     4: 5  4 */
				uint32_t   FrameStatisticsStreamoutEnable:1; /*     4: 6  4 */
				uint32_t   ScaledSurfaceEnable:1; /*     4: 7  4 */
				uint32_t   PreDeblockingOutputEnablePredeblockoutenable:1; /*     4: 8  4 */
				uint32_t   PostDeblockingOutputEnablePostdeblockoutenable:1; /*     4: 9  4 */
				uint32_t   StreamOutEnable:1;    /*     4:10  4 */
				uint32_t   PicErrorStatusReportEnable:1; /*     4:11  4 */
				uint32_t   DeblockerStreamOutEnable:1; /*     4:12  4 */
				uint32_t   VdencMode:1;          /*     4:13  4 */
				uint32_t   StandaloneVdencModeEnable:1; /*     4:14  4 */
				uint32_t   DecoderModeSelect:2;  /*     4:15  4 */
				uint32_t   DecoderShortFormatMode:1; /*     4:17  4 */
				uint32_t   ExtendedStreamOutEnable:1; /*     4:18  4 */
				uint32_t   Reserved51:13;        /*     4:19  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   Reserved64:3;         /*     8: 0  4 */
				uint32_t   VdsIldbCalculation:1; /*     8: 3  4 */
				uint32_t   Reserved68:2;         /*     8: 4  4 */
				uint32_t   ClockGateEnableAtSliceLevel:1; /*     8: 6  4 */
				uint32_t   Reserved71:3;         /*     8: 7  4 */
				uint32_t   MpcPref08X8DisableFlagDefault0:1; /*     8:10  4 */
				uint32_t   Reserved75:3;         /*     8:11  4 */
				uint32_t   Vlf720IOddHeightInVc1Mode:1; /*     8:14  4 */
				uint32_t   Reserved79:12;        /*     8:15  4 */
				uint32_t   VmbSvcTlbDummyFetchDisableForPerformance:1; /*     8:27  4 */
				uint32_t   VmbSvcMvReplicationFor8X8EnableErrorHandling:1; /*     8:28  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   PicStatusErrorReportId; /*    12     4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128;          /*    16     4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		void MFX_PIPE_MODE_SELECT_CMD(class MFX_PIPE_MODE_SELECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 5;    /*     0     0 */
		static const size_t               byteSize = 20; /*     0     0 */

		/* size: 20, cachelines: 1, members: 5, static members: 2 */
		/* last cacheline: 20 bytes */
	};

	struct MFX_SURFACE_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           Subopb:5;             /*     0:16  4 */
				uint32_t           Subopa:3;             /*     0:21  4 */
				uint32_t           Opcode:3;             /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SurfaceId:4;          /*     0: 0  4 */
				uint32_t           Reserved36:28;        /*     0: 4  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CrVCbUPixelOffsetVDirection:2; /*     0: 0  4 */
				uint32_t           Reserved66:2;         /*     0: 2  4 */
				uint32_t           Width:14;             /*     0: 4  4 */
				uint32_t           Height:14;            /*     0:18  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           TileWalk:1;           /*     0: 0  4 */
				uint32_t           TiledSurface:1;       /*     0: 1  4 */
				uint32_t           HalfPitchForChroma:1; /*     0: 2  4 */
				uint32_t           SurfacePitch:17;      /*     0: 3  4 */
				uint32_t           Reserved116:7;        /*     0:20  4 */
				uint32_t           InterleaveChroma:1;   /*     0:27  4 */
				uint32_t           SurfaceFormat:4;      /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           YOffsetForUCb:15;     /*     0: 0  4 */
				uint32_t           Reserved143:1;        /*     0:15  4 */
				uint32_t           XOffsetForUCb:15;     /*     0:16  4 */
				uint32_t           Reserved159:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           YOffsetForVCr:16;     /*     0: 0  4 */
				uint32_t           XOffsetForVCr:13;     /*     0:16  4 */
				uint32_t           Reserved189:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   Subopb:5;             /*     0:16  4 */
				uint32_t   Subopa:3;             /*     0:21  4 */
				uint32_t   Opcode:3;             /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   SurfaceId:4;          /*     4: 0  4 */
				uint32_t   Reserved36:28;        /*     4: 4  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   CrVCbUPixelOffsetVDirection:2; /*     8: 0  4 */
				uint32_t   Reserved66:2;         /*     8: 2  4 */
				uint32_t   Width:14;             /*     8: 4  4 */
				uint32_t   Height:14;            /*     8:18  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   TileWalk:1;           /*    12: 0  4 */
				uint32_t   TiledSurface:1;       /*    12: 1  4 */
				uint32_t   HalfPitchForChroma:1; /*    12: 2  4 */
				uint32_t   SurfacePitch:17;      /*    12: 3  4 */
				uint32_t   Reserved116:7;        /*    12:20  4 */
				uint32_t   InterleaveChroma:1;   /*    12:27  4 */
				uint32_t   SurfaceFormat:4;      /*    12:28  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   YOffsetForUCb:15;     /*    16: 0  4 */
				uint32_t   Reserved143:1;        /*    16:15  4 */
				uint32_t   XOffsetForUCb:15;     /*    16:16  4 */
				uint32_t   Reserved159:1;        /*    16:31  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   YOffsetForVCr:16;     /*    20: 0  4 */
				uint32_t   XOffsetForVCr:13;     /*    20:16  4 */
				uint32_t   Reserved189:3;        /*    20:29  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFX_SURFACE_STATE_CMD(class MFX_SURFACE_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFX_IND_OBJ_BASE_ADDR_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           Subopcodeb:5;         /*     0:16  4 */
				uint32_t           SubOpcodea:3;         /*     0:21  4 */
				uint32_t           CommonOpcode:3;       /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:12;        /*     0: 0  4 */
				uint32_t           MfxIndirectBitstreamObjectBaseAddressDecoderAndStitchModes:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfxIndirectBitstreamObjectDestinationAddressDecoderAndStitchModes4732:16; /*     0: 0  4 */
				uint32_t           Reserved80:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MfxIndirectBitstreamObjectbaseArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved105:4;        /*     0: 9  4 */
				uint32_t           MfxIndirectBitstreamObjectTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved111:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128:12;       /*     0: 0  4 */
				uint32_t           MfxIndirectBitstreamObjectAccessUpperBoundDecoderAndStitchModes:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfxIndirectBitstreamObjectUpperboundDecoderAndStitchModes4732:16; /*     0: 0  4 */
				uint32_t           Reserved176:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved192:12;       /*     0: 0  4 */
				uint32_t           MfxIndirectMvObjectBaseAddress:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfxIndirectMvObjectBaseAddress4732:16; /*     0: 0  4 */
				uint32_t           Reserved240:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MfxIndirectMvObjectArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved265:4;        /*     0: 9  4 */
				uint32_t           MfxIndirectMvObjectDestinationTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved271:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved288:12;       /*     0: 0  4 */
				uint32_t           MfxIndirectMvObjectAccessUpperBound:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfxIndirectMvObjectUpperbound4732:16; /*     0: 0  4 */
				uint32_t           Reserved336:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved352:12;       /*     0: 0  4 */
				uint32_t           MfdIndirectItCoeffObjectBaseAddressDecoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfdIndirectItCoeffObjectBaseAddress4732:16; /*     0: 0  4 */
				uint32_t           Reserved400:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MfdIndirectItCoeffObjectDesitnationArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved425:4;        /*     0: 9  4 */
				uint32_t           MfdIndirectItCoeffTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved431:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved448:12;       /*     0: 0  4 */
				uint32_t           MfdIndirectItCoeffObjectAccessUpperBoundDecoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfdIndirectItCoeffObjectUpperbound4732:16; /*     0: 0  4 */
				uint32_t           Reserved496:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved512:12;       /*     0: 0  4 */
				uint32_t           MfdIndirectItDblkObjectBaseAddressDecoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfdIndirectItDblkObjectBaseAddress4732:16; /*     0: 0  4 */
				uint32_t           Reserved560:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MfdIndirectItDblkObjectArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved585:4;        /*     0: 9  4 */
				uint32_t           MfdIndirectItDblkObjectDestinationTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved591:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved608:12;       /*     0: 0  4 */
				uint32_t           MfdIndirectItDblkObjectAccessUpperBoundDecoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfdIndirectItDblkObjectUpperbound4732:16; /*     0: 0  4 */
				uint32_t           Reserved656:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved672:12;       /*     0: 0  4 */
				uint32_t           MfcIndirectPakBseObjectBaseAddressEncoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfcIndirectPakBseObjectBaseAddress4732:16; /*     0: 0  4 */
				uint32_t           Reserved720:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MfcIndirectPakBseObjectDesitnationArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved745:4;        /*     0: 9  4 */
				uint32_t           MfcIndirectPakBseObjectDestinationTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved751:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved768:12;       /*     0: 0  4 */
				uint32_t           MfcIndirectPakBseObjectAccessUpperBoundEecoderOnly:20; /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MfcIndirectPakBseObjectUpperbound4732:16; /*     0: 0  4 */
				uint32_t           Reserved816:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   Subopcodeb:5;         /*     0:16  4 */
				uint32_t   SubOpcodea:3;         /*     0:21  4 */
				uint32_t   CommonOpcode:3;       /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:12;        /*     4: 0  4 */
				uint32_t   MfxIndirectBitstreamObjectBaseAddressDecoderAndStitchModes:20; /*     4:12  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   MfxIndirectBitstreamObjectDestinationAddressDecoderAndStitchModes4732:16; /*     8: 0  4 */
				uint32_t   Reserved80:16;        /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    12: 0  4 */
				uint32_t   MfxIndirectBitstreamObjectbaseArbitrationPriorityControl:2; /*    12: 7  4 */
				uint32_t   Reserved105:4;        /*    12: 9  4 */
				uint32_t   MfxIndirectBitstreamObjectTiledResourceMode:2; /*    12:13  4 */
				uint32_t   Reserved111:17;       /*    12:15  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128:12;       /*    16: 0  4 */
				uint32_t   MfxIndirectBitstreamObjectAccessUpperBoundDecoderAndStitchModes:20; /*    16:12  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   MfxIndirectBitstreamObjectUpperboundDecoderAndStitchModes4732:16; /*    20: 0  4 */
				uint32_t   Reserved176:16;       /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   Reserved192:12;       /*    24: 0  4 */
				uint32_t   MfxIndirectMvObjectBaseAddress:20; /*    24:12  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   MfxIndirectMvObjectBaseAddress4732:16; /*    28: 0  4 */
				uint32_t   Reserved240:16;       /*    28:16  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    32: 0  4 */
				uint32_t   MfxIndirectMvObjectArbitrationPriorityControl:2; /*    32: 7  4 */
				uint32_t   Reserved265:4;        /*    32: 9  4 */
				uint32_t   MfxIndirectMvObjectDestinationTiledResourceMode:2; /*    32:13  4 */
				uint32_t   Reserved271:17;       /*    32:15  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   Reserved288:12;       /*    36: 0  4 */
				uint32_t   MfxIndirectMvObjectAccessUpperBound:20; /*    36:12  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   MfxIndirectMvObjectUpperbound4732:16; /*    40: 0  4 */
				uint32_t   Reserved336:16;       /*    40:16  4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   Reserved352:12;       /*    44: 0  4 */
				uint32_t   MfdIndirectItCoeffObjectBaseAddressDecoderOnly:20; /*    44:12  4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   MfdIndirectItCoeffObjectBaseAddress4732:16; /*    48: 0  4 */
				uint32_t   Reserved400:16;       /*    48:16  4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    52: 0  4 */
				uint32_t   MfdIndirectItCoeffObjectDesitnationArbitrationPriorityControl:2; /*    52: 7  4 */
				uint32_t   Reserved425:4;        /*    52: 9  4 */
				uint32_t   MfdIndirectItCoeffTiledResourceMode:2; /*    52:13  4 */
				uint32_t   Reserved431:17;       /*    52:15  4 */
			};                                       /*    52     4 */
			uint32_t           Value;                /*    52     4 */
		} DW13;                                          /*    52     4 */
		union {
			struct {
				uint32_t   Reserved448:12;       /*    56: 0  4 */
				uint32_t   MfdIndirectItCoeffObjectAccessUpperBoundDecoderOnly:20; /*    56:12  4 */
			};                                       /*    56     4 */
			uint32_t           Value;                /*    56     4 */
		} DW14;                                          /*    56     4 */
		union {
			struct {
				uint32_t   MfdIndirectItCoeffObjectUpperbound4732:16; /*    60: 0  4 */
				uint32_t   Reserved496:16;       /*    60:16  4 */
			};                                       /*    60     4 */
			uint32_t           Value;                /*    60     4 */
		} DW15;                                          /*    60     4 */
		/* --- cacheline 1 boundary (64 bytes) --- */
		union {
			struct {
				uint32_t   Reserved512:12;       /*    64: 0  4 */
				uint32_t   MfdIndirectItDblkObjectBaseAddressDecoderOnly:20; /*    64:12  4 */
			};                                       /*    64     4 */
			uint32_t           Value;                /*    64     4 */
		} DW16;                                          /*    64     4 */
		union {
			struct {
				uint32_t   MfdIndirectItDblkObjectBaseAddress4732:16; /*    68: 0  4 */
				uint32_t   Reserved560:16;       /*    68:16  4 */
			};                                       /*    68     4 */
			uint32_t           Value;                /*    68     4 */
		} DW17;                                          /*    68     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    72: 0  4 */
				uint32_t   MfdIndirectItDblkObjectArbitrationPriorityControl:2; /*    72: 7  4 */
				uint32_t   Reserved585:4;        /*    72: 9  4 */
				uint32_t   MfdIndirectItDblkObjectDestinationTiledResourceMode:2; /*    72:13  4 */
				uint32_t   Reserved591:17;       /*    72:15  4 */
			};                                       /*    72     4 */
			uint32_t           Value;                /*    72     4 */
		} DW18;                                          /*    72     4 */
		union {
			struct {
				uint32_t   Reserved608:12;       /*    76: 0  4 */
				uint32_t   MfdIndirectItDblkObjectAccessUpperBoundDecoderOnly:20; /*    76:12  4 */
			};                                       /*    76     4 */
			uint32_t           Value;                /*    76     4 */
		} DW19;                                          /*    76     4 */
		union {
			struct {
				uint32_t   MfdIndirectItDblkObjectUpperbound4732:16; /*    80: 0  4 */
				uint32_t   Reserved656:16;       /*    80:16  4 */
			};                                       /*    80     4 */
			uint32_t           Value;                /*    80     4 */
		} DW20;                                          /*    80     4 */
		union {
			struct {
				uint32_t   Reserved672:12;       /*    84: 0  4 */
				uint32_t   MfcIndirectPakBseObjectBaseAddressEncoderOnly:20; /*    84:12  4 */
			};                                       /*    84     4 */
			uint32_t           Value;                /*    84     4 */
		} DW21;                                          /*    84     4 */
		union {
			struct {
				uint32_t   MfcIndirectPakBseObjectBaseAddress4732:16; /*    88: 0  4 */
				uint32_t   Reserved720:16;       /*    88:16  4 */
			};                                       /*    88     4 */
			uint32_t           Value;                /*    88     4 */
		} DW22;                                          /*    88     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    92: 0  4 */
				uint32_t   MfcIndirectPakBseObjectDesitnationArbitrationPriorityControl:2; /*    92: 7  4 */
				uint32_t   Reserved745:4;        /*    92: 9  4 */
				uint32_t   MfcIndirectPakBseObjectDestinationTiledResourceMode:2; /*    92:13  4 */
				uint32_t   Reserved751:17;       /*    92:15  4 */
			};                                       /*    92     4 */
			uint32_t           Value;                /*    92     4 */
		} DW23;                                          /*    92     4 */
		union {
			struct {
				uint32_t   Reserved768:12;       /*    96: 0  4 */
				uint32_t   MfcIndirectPakBseObjectAccessUpperBoundEecoderOnly:20; /*    96:12  4 */
			};                                       /*    96     4 */
			uint32_t           Value;                /*    96     4 */
		} DW24;                                          /*    96     4 */
		union {
			struct {
				uint32_t   MfcIndirectPakBseObjectUpperbound4732:16; /*   100: 0  4 */
				uint32_t   Reserved816:16;       /*   100:16  4 */
			};                                       /*   100     4 */
			uint32_t           Value;                /*   100     4 */
		} DW25;                                          /*   100     4 */
		void MFX_IND_OBJ_BASE_ADDR_STATE_CMD(class MFX_IND_OBJ_BASE_ADDR_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 26;   /*     0     0 */
		static const size_t               byteSize = 104; /*     0     0 */

		/* size: 104, cachelines: 2, members: 26, static members: 2 */
		/* last cacheline: 40 bytes */
	};

	struct MFX_BSP_BUF_BASE_ADDR_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:6;         /*     0: 0  4 */
				uint32_t           BsdMpcRowStoreScratchBufferBaseAddressReadWrite:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           BsdMpcRowStoreScratchBufferBaseAddressReadWrite4732:16; /*     0: 0  4 */
				uint32_t           Reserved80:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           BsdMpcRowStoreScratchBufferArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved105:3;        /*     0: 9  4 */
				uint32_t           BsdMpcRowStoreScratchBufferCacheSelect:1; /*     0:12  4 */
				uint32_t           BsdMpcRowStoreScratchBufferTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved111:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128:6;        /*     0: 0  4 */
				uint32_t           MprRowStoreScratchBufferBaseAddressReadWriteDecoderOnly:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MprRowStoreScratchBufferBaseAddressReadWrite4732:16; /*     0: 0  4 */
				uint32_t           Reserved176:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           MprRowStoreScratchBufferArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved201:3;        /*     0: 9  4 */
				uint32_t           MprRowStoreScratchBufferCacheSelect:1; /*     0:12  4 */
				uint32_t           MprRowStoreScratchBufferTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved207:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved224:6;        /*     0: 0  4 */
				uint32_t           BitplaneReadBufferBaseAddress:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           BitplaneReadBufferBaseAddressReadWrite4732:16; /*     0: 0  4 */
				uint32_t           Reserved272:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           BitplaneReadBufferArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved297:4;        /*     0: 9  4 */
				uint32_t           BitplaneReadBufferTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved303:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:6;         /*     4: 0  4 */
				uint32_t   BsdMpcRowStoreScratchBufferBaseAddressReadWrite:26; /*     4: 6  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   BsdMpcRowStoreScratchBufferBaseAddressReadWrite4732:16; /*     8: 0  4 */
				uint32_t   Reserved80:16;        /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    12: 0  4 */
				uint32_t   BsdMpcRowStoreScratchBufferArbitrationPriorityControl:2; /*    12: 7  4 */
				uint32_t   Reserved105:3;        /*    12: 9  4 */
				uint32_t   BsdMpcRowStoreScratchBufferCacheSelect:1; /*    12:12  4 */
				uint32_t   BsdMpcRowStoreScratchBufferTiledResourceMode:2; /*    12:13  4 */
				uint32_t   Reserved111:17;       /*    12:15  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128:6;        /*    16: 0  4 */
				uint32_t   MprRowStoreScratchBufferBaseAddressReadWriteDecoderOnly:26; /*    16: 6  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   MprRowStoreScratchBufferBaseAddressReadWrite4732:16; /*    20: 0  4 */
				uint32_t   Reserved176:16;       /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    24: 0  4 */
				uint32_t   MprRowStoreScratchBufferArbitrationPriorityControl:2; /*    24: 7  4 */
				uint32_t   Reserved201:3;        /*    24: 9  4 */
				uint32_t   MprRowStoreScratchBufferCacheSelect:1; /*    24:12  4 */
				uint32_t   MprRowStoreScratchBufferTiledResourceMode:2; /*    24:13  4 */
				uint32_t   Reserved207:17;       /*    24:15  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   Reserved224:6;        /*    28: 0  4 */
				uint32_t   BitplaneReadBufferBaseAddress:26; /*    28: 6  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   BitplaneReadBufferBaseAddressReadWrite4732:16; /*    32: 0  4 */
				uint32_t   Reserved272:16;       /*    32:16  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    36: 0  4 */
				uint32_t   BitplaneReadBufferArbitrationPriorityControl:2; /*    36: 7  4 */
				uint32_t   Reserved297:4;        /*    36: 9  4 */
				uint32_t   BitplaneReadBufferTiledResourceMode:2; /*    36:13  4 */
				uint32_t   Reserved303:17;       /*    36:15  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		void MFX_BSP_BUF_BASE_ADDR_STATE_CMD(class MFX_BSP_BUF_BASE_ADDR_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 10;   /*     0     0 */
		static const size_t               byteSize = 40; /*     0     0 */

		/* size: 40, cachelines: 1, members: 10, static members: 2 */
		/* last cacheline: 40 bytes */
	};

	struct MFD_AVC_PICID_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PictureidRemappingDisable:1; /*     0: 0  4 */
				uint32_t           Reserved33:31;        /*     0: 1  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   PictureidRemappingDisable:1; /*     4: 0  4 */
				uint32_t   Reserved33:31;        /*     4: 1  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   Pictureidlist1616Bits[8]; /*     8    32 */
		void MFD_AVC_PICID_STATE_CMD(class MFD_AVC_PICID_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 10;   /*     0     0 */
		static const size_t               byteSize = 40; /*     0     0 */

		/* size: 40, cachelines: 1, members: 3, static members: 2 */
		/* last cacheline: 40 bytes */
	};

	struct MFX_AVC_IMG_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameSize:16;         /*     0: 0  4 */
				uint32_t           Reserved48:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameWidth:8;         /*     0: 0  4 */
				uint32_t           Reserved72:8;         /*     0: 8  4 */
				uint32_t           FrameHeight:8;        /*     0:16  4 */
				uint32_t           Reserved88:8;         /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved96:8;         /*     0: 0  4 */
				uint32_t           ImgstructImageStructureImgStructure10:2; /*     0: 8  4 */
				uint32_t           WeightedBipredIdc:2;  /*     0:10  4 */
				uint32_t           WeightedPredFlag:1;   /*     0:12  4 */
				uint32_t           RhodomainRateControlEnable:1; /*     0:13  4 */
				uint32_t           Reserved110:2;        /*     0:14  4 */
				uint32_t           FirstChromaQpOffset:5; /*     0:16  4 */
				uint32_t           Reserved117:3;        /*     0:21  4 */
				uint32_t           SecondChromaQpOffset:5; /*     0:24  4 */
				uint32_t           Reserved125:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Fieldpicflag:1;       /*     0: 0  4 */
				uint32_t           Mbaffflameflag:1;     /*     0: 1  4 */
				uint32_t           Framembonlyflag:1;    /*     0: 2  4 */
				uint32_t           Transform8X8Flag:1;   /*     0: 3  4 */
				uint32_t           Direct8X8Infflag:1;   /*     0: 4  4 */
				uint32_t           Constrainedipredflag:1; /*     0: 5  4 */
				uint32_t           Imgdisposableflag:1;  /*     0: 6  4 */
				uint32_t           Entropycodingflag:1;  /*     0: 7  4 */
				uint32_t           Mbmvformatflag:1;     /*     0: 8  4 */
				uint32_t           Reserved137:1;        /*     0: 9  4 */
				uint32_t           Chromaformatidc:2;    /*     0:10  4 */
				uint32_t           Mvunpackedflag:1;     /*     0:12  4 */
				uint32_t           Reserved141:1;        /*     0:13  4 */
				uint32_t           Loadslicepointerflag:1; /*     0:14  4 */
				uint32_t           Mbstatenabled:1;      /*     0:15  4 */
				uint32_t           Minframewsize:16;     /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntrambmaxbitflagIntrambmaxsizereportmask:1; /*     0: 0  4 */
				uint32_t           IntermbmaxbitflagIntermbmaxsizereportmask:1; /*     0: 1  4 */
				uint32_t           FrameszoverflagFramebitratemaxreportmask:1; /*     0: 2  4 */
				uint32_t           FrameszunderflagFramebitrateminreportmask:1; /*     0: 3  4 */
				uint32_t           Reserved164:3;        /*     0: 4  4 */
				uint32_t           IntraIntermbipcmflagForceipcmcontrolmask:1; /*     0: 7  4 */
				uint32_t           Reserved168:1;        /*     0: 8  4 */
				uint32_t           MbratectrlflagMbLevelRateControlEnablingFlag:1; /*     0: 9  4 */
				uint32_t           Minframewsizeunits:2; /*     0:10  4 */
				uint32_t           Reserved172:4;        /*     0:12  4 */
				uint32_t           Nonfirstpassflag:1;   /*     0:16  4 */
				uint32_t           Reserved177:10;       /*     0:17  4 */
				uint32_t           TrellisQuantizationChromaDisableTqchromadisable:1; /*     0:27  4 */
				uint32_t           TrellisQuantizationRoundingTqr:3; /*     0:28  4 */
				uint32_t           TrellisQuantizationEnabledTqenb:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Intrambmaxsz:12;      /*     0: 0  4 */
				uint32_t           Reserved204:4;        /*     0:12  4 */
				uint32_t           Intermbmaxsz:12;      /*     0:16  4 */
				uint32_t           Reserved220:4;        /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           VslTopMbTrans8X8Flag:1; /*     0: 0  4 */
				uint32_t           Reserved225:15;       /*     0: 1  4 */
				uint32_t           BspEncoderEcoEnable:1; /*     0:16  4 */
				uint32_t           Reserved241:15;       /*     0:17  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Slicedeltaqppmax0:8;  /*     0: 0  4 */
				uint32_t           Slicedeltaqpmax1:8;   /*     0: 8  4 */
				uint32_t           Slicedeltaqpmax2:8;   /*     0:16  4 */
				uint32_t           Slicedeltaqpmax3:8;   /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Slicedeltaqpmin0:8;   /*     0: 0  4 */
				uint32_t           Slicedeltaqpmin1:8;   /*     0: 8  4 */
				uint32_t           Slicedeltaqpmin2:8;   /*     0:16  4 */
				uint32_t           Slicedeltaqpmin3:8;   /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Framebitratemin:14;   /*     0: 0  4 */
				uint32_t           Framebitrateminunitmode:1; /*     0:14  4 */
				uint32_t           Framebitrateminunit:1; /*     0:15  4 */
				uint32_t           Framebitratemax:14;   /*     0:16  4 */
				uint32_t           Framebitratemaxunitmode:1; /*     0:30  4 */
				uint32_t           Framebitratemaxunit:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Framebitratemindelta:15; /*     0: 0  4 */
				uint32_t           Reserved367:1;        /*     0:15  4 */
				uint32_t           Framebitratemaxdelta:15; /*     0:16  4 */
				uint32_t           SliceStatsStreamoutEnable:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved384;          /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           InitialQpValue:8;     /*     0: 0  4 */
				uint32_t           NumberOfActiveReferencePicturesFromL0:6; /*     0: 8  4 */
				uint32_t           Reserved430:2;        /*     0:14  4 */
				uint32_t           NumberOfActiveReferencePicturesFromL1:6; /*     0:16  4 */
				uint32_t           Reserved438:2;        /*     0:22  4 */
				uint32_t           NumberOfReferenceFrames:5; /*     0:24  4 */
				uint32_t           CurrentPictureHasPerformedMmco5:1; /*     0:29  4 */
				uint32_t           Reserved446:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PicOrderPresentFlag:1; /*     0: 0  4 */
				uint32_t           DeltaPicOrderAlwaysZeroFlag:1; /*     0: 1  4 */
				uint32_t           PicOrderCntType:2;    /*     0: 2  4 */
				uint32_t           Reserved452:4;        /*     0: 4  4 */
				uint32_t           SliceGroupMapType:3;  /*     0: 8  4 */
				uint32_t           RedundantPicCntPresentFlag:1; /*     0:11  4 */
				uint32_t           NumSliceGroupsMinus1:3; /*     0:12  4 */
				uint32_t           DeblockingFilterControlPresentFlag:1; /*     0:15  4 */
				uint32_t           Log2MaxFrameNumMinus4:8; /*     0:16  4 */
				uint32_t           Log2MaxPicOrderCntLsbMinus4:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SliceGroupChangeRate:16; /*     0: 0  4 */
				uint32_t           CurrPicFrameNum:16;   /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint64_t           CurrentFrameViewId:10; /*     0: 0  8 */
				uint64_t           Reserved522:2;        /*     0:10  8 */
				uint64_t           MaxViewIdxl0:4;       /*     0:12  8 */
				uint64_t           Reserved528:2;        /*     0:16  8 */
				uint64_t           MaxViewIdxl1:4;       /*     0:18  8 */
				uint64_t           Reserved534:9;        /*     0:22  8 */
				uint64_t           InterViewOrderDisable:1; /*     0:31  8 */
				uint64_t           Reserved544:8;        /*     0:32  8 */
				uint64_t           ExtendedRhodomainStatisticsEnable:1; /*     0:40  8 */
				uint64_t           Reserved554:7;        /*     0:41  8 */
				uint64_t           RhodomainAveragemacroblockqp:6; /*     0:48  8 */
				uint64_t           Reserved566:10;       /*     0:54  8 */
			};                                               /*     0     8 */
			uint32_t                   Value[2];             /*     0     8 */
		};

		union {
			struct {
				uint32_t           Reserved576;          /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           ThresholdSizeInBytes; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           TargetSliceSizeInBytes; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   FrameSize:16;         /*     4: 0  4 */
				uint32_t   Reserved48:16;        /*     4:16  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   FrameWidth:8;         /*     8: 0  4 */
				uint32_t   Reserved72:8;         /*     8: 8  4 */
				uint32_t   FrameHeight:8;        /*     8:16  4 */
				uint32_t   Reserved88:8;         /*     8:24  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Reserved96:8;         /*    12: 0  4 */
				uint32_t   ImgstructImageStructureImgStructure10:2; /*    12: 8  4 */
				uint32_t   WeightedBipredIdc:2;  /*    12:10  4 */
				uint32_t   WeightedPredFlag:1;   /*    12:12  4 */
				uint32_t   RhodomainRateControlEnable:1; /*    12:13  4 */
				uint32_t   Reserved110:2;        /*    12:14  4 */
				uint32_t   FirstChromaQpOffset:5; /*    12:16  4 */
				uint32_t   Reserved117:3;        /*    12:21  4 */
				uint32_t   SecondChromaQpOffset:5; /*    12:24  4 */
				uint32_t   Reserved125:3;        /*    12:29  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Fieldpicflag:1;       /*    16: 0  4 */
				uint32_t   Mbaffflameflag:1;     /*    16: 1  4 */
				uint32_t   Framembonlyflag:1;    /*    16: 2  4 */
				uint32_t   Transform8X8Flag:1;   /*    16: 3  4 */
				uint32_t   Direct8X8Infflag:1;   /*    16: 4  4 */
				uint32_t   Constrainedipredflag:1; /*    16: 5  4 */
				uint32_t   Imgdisposableflag:1;  /*    16: 6  4 */
				uint32_t   Entropycodingflag:1;  /*    16: 7  4 */
				uint32_t   Mbmvformatflag:1;     /*    16: 8  4 */
				uint32_t   Reserved137:1;        /*    16: 9  4 */
				uint32_t   Chromaformatidc:2;    /*    16:10  4 */
				uint32_t   Mvunpackedflag:1;     /*    16:12  4 */
				uint32_t   Reserved141:1;        /*    16:13  4 */
				uint32_t   Loadslicepointerflag:1; /*    16:14  4 */
				uint32_t   Mbstatenabled:1;      /*    16:15  4 */
				uint32_t   Minframewsize:16;     /*    16:16  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   IntrambmaxbitflagIntrambmaxsizereportmask:1; /*    20: 0  4 */
				uint32_t   IntermbmaxbitflagIntermbmaxsizereportmask:1; /*    20: 1  4 */
				uint32_t   FrameszoverflagFramebitratemaxreportmask:1; /*    20: 2  4 */
				uint32_t   FrameszunderflagFramebitrateminreportmask:1; /*    20: 3  4 */
				uint32_t   Reserved164:3;        /*    20: 4  4 */
				uint32_t   IntraIntermbipcmflagForceipcmcontrolmask:1; /*    20: 7  4 */
				uint32_t   Reserved168:1;        /*    20: 8  4 */
				uint32_t   MbratectrlflagMbLevelRateControlEnablingFlag:1; /*    20: 9  4 */
				uint32_t   Minframewsizeunits:2; /*    20:10  4 */
				uint32_t   Reserved172:4;        /*    20:12  4 */
				uint32_t   Nonfirstpassflag:1;   /*    20:16  4 */
				uint32_t   Reserved177:10;       /*    20:17  4 */
				uint32_t   TrellisQuantizationChromaDisableTqchromadisable:1; /*    20:27  4 */
				uint32_t   TrellisQuantizationRoundingTqr:3; /*    20:28  4 */
				uint32_t   TrellisQuantizationEnabledTqenb:1; /*    20:31  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   Intrambmaxsz:12;      /*    24: 0  4 */
				uint32_t   Reserved204:4;        /*    24:12  4 */
				uint32_t   Intermbmaxsz:12;      /*    24:16  4 */
				uint32_t   Reserved220:4;        /*    24:28  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   VslTopMbTrans8X8Flag:1; /*    28: 0  4 */
				uint32_t   Reserved225:15;       /*    28: 1  4 */
				uint32_t   BspEncoderEcoEnable:1; /*    28:16  4 */
				uint32_t   Reserved241:15;       /*    28:17  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   Slicedeltaqppmax0:8;  /*    32: 0  4 */
				uint32_t   Slicedeltaqpmax1:8;   /*    32: 8  4 */
				uint32_t   Slicedeltaqpmax2:8;   /*    32:16  4 */
				uint32_t   Slicedeltaqpmax3:8;   /*    32:24  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   Slicedeltaqpmin0:8;   /*    36: 0  4 */
				uint32_t   Slicedeltaqpmin1:8;   /*    36: 8  4 */
				uint32_t   Slicedeltaqpmin2:8;   /*    36:16  4 */
				uint32_t   Slicedeltaqpmin3:8;   /*    36:24  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   Framebitratemin:14;   /*    40: 0  4 */
				uint32_t   Framebitrateminunitmode:1; /*    40:14  4 */
				uint32_t   Framebitrateminunit:1; /*    40:15  4 */
				uint32_t   Framebitratemax:14;   /*    40:16  4 */
				uint32_t   Framebitratemaxunitmode:1; /*    40:30  4 */
				uint32_t   Framebitratemaxunit:1; /*    40:31  4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   Framebitratemindelta:15; /*    44: 0  4 */
				uint32_t   Reserved367:1;        /*    44:15  4 */
				uint32_t   Framebitratemaxdelta:15; /*    44:16  4 */
				uint32_t   SliceStatsStreamoutEnable:1; /*    44:31  4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   Reserved384;          /*    48     4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		union {
			struct {
				uint32_t   InitialQpValue:8;     /*    52: 0  4 */
				uint32_t   NumberOfActiveReferencePicturesFromL0:6; /*    52: 8  4 */
				uint32_t   Reserved430:2;        /*    52:14  4 */
				uint32_t   NumberOfActiveReferencePicturesFromL1:6; /*    52:16  4 */
				uint32_t   Reserved438:2;        /*    52:22  4 */
				uint32_t   NumberOfReferenceFrames:5; /*    52:24  4 */
				uint32_t   CurrentPictureHasPerformedMmco5:1; /*    52:29  4 */
				uint32_t   Reserved446:2;        /*    52:30  4 */
			};                                       /*    52     4 */
			uint32_t           Value;                /*    52     4 */
		} DW13;                                          /*    52     4 */
		union {
			struct {
				uint32_t   PicOrderPresentFlag:1; /*    56: 0  4 */
				uint32_t   DeltaPicOrderAlwaysZeroFlag:1; /*    56: 1  4 */
				uint32_t   PicOrderCntType:2;    /*    56: 2  4 */
				uint32_t   Reserved452:4;        /*    56: 4  4 */
				uint32_t   SliceGroupMapType:3;  /*    56: 8  4 */
				uint32_t   RedundantPicCntPresentFlag:1; /*    56:11  4 */
				uint32_t   NumSliceGroupsMinus1:3; /*    56:12  4 */
				uint32_t   DeblockingFilterControlPresentFlag:1; /*    56:15  4 */
				uint32_t   Log2MaxFrameNumMinus4:8; /*    56:16  4 */
				uint32_t   Log2MaxPicOrderCntLsbMinus4:8; /*    56:24  4 */
			};                                       /*    56     4 */
			uint32_t           Value;                /*    56     4 */
		} DW14;                                          /*    56     4 */
		union {
			struct {
				uint32_t   SliceGroupChangeRate:16; /*    60: 0  4 */
				uint32_t   CurrPicFrameNum:16;   /*    60:16  4 */
			};                                       /*    60     4 */
			uint32_t           Value;                /*    60     4 */
		} DW15;                                          /*    60     4 */
		union {
			struct {
				uint64_t   CurrentFrameViewId:10; /*    64: 0  8 */
				uint64_t   Reserved522:2;        /*    64:10  8 */
				uint64_t   MaxViewIdxl0:4;       /*    64:12  8 */
				uint64_t   Reserved528:2;        /*    64:16  8 */
				uint64_t   MaxViewIdxl1:4;       /*    64:18  8 */
				uint64_t   Reserved534:9;        /*    64:22  8 */
				uint64_t   InterViewOrderDisable:1; /*    64:31  8 */
				uint64_t   Reserved544:8;        /*    64:32  8 */
				uint64_t   ExtendedRhodomainStatisticsEnable:1; /*    64:40  8 */
				uint64_t   Reserved554:7;        /*    64:41  8 */
				uint64_t   RhodomainAveragemacroblockqp:6; /*    64:48  8 */
				uint64_t   Reserved566:10;       /*    64:54  8 */
			};                                       /*    64     8 */
			uint32_t           Value[2];             /*    64     8 */
		} DW16_17;                                       /*    64     8 */
		union {
			struct {
				uint32_t   Reserved576;          /*    72     4 */
			};                                       /*    72     4 */
			uint32_t           Value;                /*    72     4 */
		} DW18;                                          /*    72     4 */
		union {
			struct {
				uint32_t   ThresholdSizeInBytes; /*    76     4 */
			};                                       /*    76     4 */
			uint32_t           Value;                /*    76     4 */
		} DW19;                                          /*    76     4 */
		union {
			struct {
				uint32_t   TargetSliceSizeInBytes; /*    80     4 */
			};                                       /*    80     4 */
			uint32_t           Value;                /*    80     4 */
		} DW20;                                          /*    80     4 */
		void MFX_AVC_IMG_STATE_CMD(class MFX_AVC_IMG_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 21;   /*     0     0 */
		static const size_t               byteSize = 84; /*     0     0 */

		/* size: 84, cachelines: 2, members: 20, static members: 2 */
		/* last cacheline: 20 bytes */
	} __attribute__((__packed__));

	struct MFX_AVC_REF_IDX_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           Subopcodeb:5;         /*     0:16  4 */
				uint32_t           Subopcodea:3;         /*     0:21  4 */
				uint32_t           CommandOpcode:3;      /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           RefpiclistSelect:1;   /*     0: 0  4 */
				uint32_t           Reserved33:31;        /*     0: 1  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   Subopcodeb:5;         /*     0:16  4 */
				uint32_t   Subopcodea:3;         /*     0:21  4 */
				uint32_t   CommandOpcode:3;      /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   RefpiclistSelect:1;   /*     4: 0  4 */
				uint32_t   Reserved33:31;        /*     4: 1  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   ReferenceListEntry[8]; /*     8    32 */
		void MFX_AVC_REF_IDX_STATE_CMD(class MFX_AVC_REF_IDX_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 10;   /*     0     0 */
		static const size_t               byteSize = 40; /*     0     0 */

		/* size: 40, cachelines: 1, members: 3, static members: 2 */
		/* last cacheline: 40 bytes */
	};

	struct MFX_AVC_WEIGHTOFFSET_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           WeightAndOffsetSelect:1; /*     0: 0  4 */
				uint32_t           Reserved33:31;        /*     0: 1  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   WeightAndOffsetSelect:1; /*     4: 0  4 */
				uint32_t   Reserved33:31;        /*     4: 1  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   Weightoffset[96];     /*     8   384 */
		void MFX_AVC_WEIGHTOFFSET_STATE_CMD(class MFX_AVC_WEIGHTOFFSET_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 98;   /*     0     0 */
		static const size_t               byteSize = 392; /*     0     0 */

		/* size: 392, cachelines: 7, members: 3, static members: 2 */
		/* last cacheline: 8 bytes */
	};

	struct MFX_AVC_SLICE_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           CommandSubopcodeb:5;  /*     0:16  4 */
				uint32_t           Subopcodea:3;         /*     0:21  4 */
				uint32_t           CommandOpcode:3;      /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SliceType:4;          /*     0: 0  4 */
				uint32_t           Reserved36:28;        /*     0: 4  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Log2WeightDenomLuma:3; /*     0: 0  4 */
				uint32_t           Reserved67:5;         /*     0: 3  4 */
				uint32_t           Log2WeightDenomChroma:3; /*     0: 8  4 */
				uint32_t           Reserved75:5;         /*     0:11  4 */
				uint32_t           NumberOfReferencePicturesInInterPredictionList0:6; /*     0:16  4 */
				uint32_t           Reserved86:2;         /*     0:22  4 */
				uint32_t           NumberOfReferencePicturesInInterPredictionList1:6; /*     0:24  4 */
				uint32_t           Reserved94:2;         /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SliceAlphaC0OffsetDiv2:4; /*     0: 0  4 */
				uint32_t           Reserved100:4;        /*     0: 4  4 */
				uint32_t           SliceBetaOffsetDiv2:4; /*     0: 8  4 */
				uint32_t           Reserved108:4;        /*     0:12  4 */
				uint32_t           SliceQuantizationParameter:6; /*     0:16  4 */
				uint32_t           Reserved118:2;        /*     0:22  4 */
				uint32_t           CabacInitIdc10:2;     /*     0:24  4 */
				uint32_t           Reserved122:1;        /*     0:26  4 */
				uint32_t           DisableDeblockingFilterIndicator:2; /*     0:27  4 */
				uint32_t           DirectPredictionType:1; /*     0:29  4 */
				uint32_t           WeightedPredictionIndicator:2; /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SliceStartMbNum:15;   /*     0: 0  4 */
				uint32_t           Reserved143:1;        /*     0:15  4 */
				uint32_t           SliceHorizontalPosition:8; /*     0:16  4 */
				uint32_t           SliceVerticalPosition:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           NextSliceHorizontalPosition:9; /*     0: 0  4 */
				uint32_t           Reserved168:7;        /*     0: 9  4 */
				uint32_t           NextSliceVerticalPosition:9; /*     0:16  4 */
				uint32_t           Reserved184:7;        /*     0:25  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           StreamId10:2;         /*     0: 0  4 */
				uint32_t           Reserved194:2;        /*     0: 2  4 */
				uint32_t           SliceId30:4;          /*     0: 4  4 */
				uint32_t           Reserved200:4;        /*     0: 8  4 */
				uint32_t           Cabaczerowordinsertionenable:1; /*     0:12  4 */
				uint32_t           Emulationbytesliceinsertenable:1; /*     0:13  4 */
				uint32_t           Reserved206:1;        /*     0:14  4 */
				uint32_t           TailInsertionPresentInBitstream:1; /*     0:15  4 */
				uint32_t           SlicedataInsertionPresentInBitstream:1; /*     0:16  4 */
				uint32_t           HeaderInsertionPresentInBitstream:1; /*     0:17  4 */
				uint32_t           Reserved210:1;        /*     0:18  4 */
				uint32_t           IsLastSlice:1;        /*     0:19  4 */
				uint32_t           MbTypeSkipConversionDisable:1; /*     0:20  4 */
				uint32_t           MbTypeDirectConversionDisable:1; /*     0:21  4 */
				uint32_t           RcPanicType:1;        /*     0:22  4 */
				uint32_t           RcPanicEnable:1;      /*     0:23  4 */
				uint32_t           RcStableTolerance:4;  /*     0:24  4 */
				uint32_t           RcTriggleMode:2;      /*     0:28  4 */
				uint32_t           Resetratecontrolcounter:1; /*     0:30  4 */
				uint32_t           RateControlCounterEnable:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPakBseDataStartAddressWrite:29; /*     0: 0  4 */
				uint32_t           Reserved253:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           GrowParamGrowInit:4;  /*     0: 0  4 */
				uint32_t           GrowParamGrowResistance:4; /*     0: 4  4 */
				uint32_t           ShrinkParamShrinkInit:4; /*     0: 8  4 */
				uint32_t           ShrinkParamShrinkResistance:4; /*     0:12  4 */
				uint32_t           MagnitudeOfQpMaxPositiveModifier:8; /*     0:16  4 */
				uint32_t           MagnitudeOfQpMaxNegativeModifier:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Correct1:4;           /*     0: 0  4 */
				uint32_t           Correct2:4;           /*     0: 4  4 */
				uint32_t           Correct3:4;           /*     0: 8  4 */
				uint32_t           Correct4:4;           /*     0:12  4 */
				uint32_t           Correct5:4;           /*     0:16  4 */
				uint32_t           Correct6:4;           /*     0:20  4 */
				uint32_t           Roundintra:3;         /*     0:24  4 */
				uint32_t           Roundintraenable:1;   /*     0:27  4 */
				uint32_t           Roundinter:3;         /*     0:28  4 */
				uint32_t           Roundinterenable:1;   /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Cv0ClampValue0:4;     /*     0: 0  4 */
				uint32_t           Cv1:4;                /*     0: 4  4 */
				uint32_t           Cv2:4;                /*     0: 8  4 */
				uint32_t           Cv3:4;                /*     0:12  4 */
				uint32_t           Cv4:4;                /*     0:16  4 */
				uint32_t           Cv5:4;                /*     0:20  4 */
				uint32_t           Cv6:4;                /*     0:24  4 */
				uint32_t           ClampvaluesCv7:4;     /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   CommandSubopcodeb:5;  /*     0:16  4 */
				uint32_t   Subopcodea:3;         /*     0:21  4 */
				uint32_t   CommandOpcode:3;      /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   SliceType:4;          /*     4: 0  4 */
				uint32_t   Reserved36:28;        /*     4: 4  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   Log2WeightDenomLuma:3; /*     8: 0  4 */
				uint32_t   Reserved67:5;         /*     8: 3  4 */
				uint32_t   Log2WeightDenomChroma:3; /*     8: 8  4 */
				uint32_t   Reserved75:5;         /*     8:11  4 */
				uint32_t   NumberOfReferencePicturesInInterPredictionList0:6; /*     8:16  4 */
				uint32_t   Reserved86:2;         /*     8:22  4 */
				uint32_t   NumberOfReferencePicturesInInterPredictionList1:6; /*     8:24  4 */
				uint32_t   Reserved94:2;         /*     8:30  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   SliceAlphaC0OffsetDiv2:4; /*    12: 0  4 */
				uint32_t   Reserved100:4;        /*    12: 4  4 */
				uint32_t   SliceBetaOffsetDiv2:4; /*    12: 8  4 */
				uint32_t   Reserved108:4;        /*    12:12  4 */
				uint32_t   SliceQuantizationParameter:6; /*    12:16  4 */
				uint32_t   Reserved118:2;        /*    12:22  4 */
				uint32_t   CabacInitIdc10:2;     /*    12:24  4 */
				uint32_t   Reserved122:1;        /*    12:26  4 */
				uint32_t   DisableDeblockingFilterIndicator:2; /*    12:27  4 */
				uint32_t   DirectPredictionType:1; /*    12:29  4 */
				uint32_t   WeightedPredictionIndicator:2; /*    12:30  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   SliceStartMbNum:15;   /*    16: 0  4 */
				uint32_t   Reserved143:1;        /*    16:15  4 */
				uint32_t   SliceHorizontalPosition:8; /*    16:16  4 */
				uint32_t   SliceVerticalPosition:8; /*    16:24  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   NextSliceHorizontalPosition:9; /*    20: 0  4 */
				uint32_t   Reserved168:7;        /*    20: 9  4 */
				uint32_t   NextSliceVerticalPosition:9; /*    20:16  4 */
				uint32_t   Reserved184:7;        /*    20:25  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   StreamId10:2;         /*    24: 0  4 */
				uint32_t   Reserved194:2;        /*    24: 2  4 */
				uint32_t   SliceId30:4;          /*    24: 4  4 */
				uint32_t   Reserved200:4;        /*    24: 8  4 */
				uint32_t   Cabaczerowordinsertionenable:1; /*    24:12  4 */
				uint32_t   Emulationbytesliceinsertenable:1; /*    24:13  4 */
				uint32_t   Reserved206:1;        /*    24:14  4 */
				uint32_t   TailInsertionPresentInBitstream:1; /*    24:15  4 */
				uint32_t   SlicedataInsertionPresentInBitstream:1; /*    24:16  4 */
				uint32_t   HeaderInsertionPresentInBitstream:1; /*    24:17  4 */
				uint32_t   Reserved210:1;        /*    24:18  4 */
				uint32_t   IsLastSlice:1;        /*    24:19  4 */
				uint32_t   MbTypeSkipConversionDisable:1; /*    24:20  4 */
				uint32_t   MbTypeDirectConversionDisable:1; /*    24:21  4 */
				uint32_t   RcPanicType:1;        /*    24:22  4 */
				uint32_t   RcPanicEnable:1;      /*    24:23  4 */
				uint32_t   RcStableTolerance:4;  /*    24:24  4 */
				uint32_t   RcTriggleMode:2;      /*    24:28  4 */
				uint32_t   Resetratecontrolcounter:1; /*    24:30  4 */
				uint32_t   RateControlCounterEnable:1; /*    24:31  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   IndirectPakBseDataStartAddressWrite:29; /*    28: 0  4 */
				uint32_t   Reserved253:3;        /*    28:29  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   GrowParamGrowInit:4;  /*    32: 0  4 */
				uint32_t   GrowParamGrowResistance:4; /*    32: 4  4 */
				uint32_t   ShrinkParamShrinkInit:4; /*    32: 8  4 */
				uint32_t   ShrinkParamShrinkResistance:4; /*    32:12  4 */
				uint32_t   MagnitudeOfQpMaxPositiveModifier:8; /*    32:16  4 */
				uint32_t   MagnitudeOfQpMaxNegativeModifier:8; /*    32:24  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   Correct1:4;           /*    36: 0  4 */
				uint32_t   Correct2:4;           /*    36: 4  4 */
				uint32_t   Correct3:4;           /*    36: 8  4 */
				uint32_t   Correct4:4;           /*    36:12  4 */
				uint32_t   Correct5:4;           /*    36:16  4 */
				uint32_t   Correct6:4;           /*    36:20  4 */
				uint32_t   Roundintra:3;         /*    36:24  4 */
				uint32_t   Roundintraenable:1;   /*    36:27  4 */
				uint32_t   Roundinter:3;         /*    36:28  4 */
				uint32_t   Roundinterenable:1;   /*    36:31  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   Cv0ClampValue0:4;     /*    40: 0  4 */
				uint32_t   Cv1:4;                /*    40: 4  4 */
				uint32_t   Cv2:4;                /*    40: 8  4 */
				uint32_t   Cv3:4;                /*    40:12  4 */
				uint32_t   Cv4:4;                /*    40:16  4 */
				uint32_t   Cv5:4;                /*    40:20  4 */
				uint32_t   Cv6:4;                /*    40:24  4 */
				uint32_t   ClampvaluesCv7:4;     /*    40:28  4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		void MFX_AVC_SLICE_STATE_CMD(class MFX_AVC_SLICE_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 11;   /*     0     0 */
		static const size_t               byteSize = 44; /*     0     0 */

		/* size: 44, cachelines: 1, members: 11, static members: 2 */
		/* last cacheline: 44 bytes */
	};

	struct MFD_AVC_DPB_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           NonExistingframeFlag161Bit:16; /*     0: 0  4 */
				uint32_t           LongtermframeFlag161Bit:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           UsedforreferenceFlag162Bits; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   NonExistingframeFlag161Bit:16; /*     4: 0  4 */
				uint32_t   LongtermframeFlag161Bit:16; /*     4:16  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   UsedforreferenceFlag162Bits; /*     8     4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		uint32_t                   Ltstframenumlist1616Bits[8]; /*    12    32 */
		uint32_t                   Viewidlist1616Bits[8]; /*    44    32 */
		uint32_t                   Vieworderlistl0168Bits[4]; /*    76    16 */
		uint32_t                   Vieworderlistl1168Bits[4]; /*    92    16 */
		void MFD_AVC_DPB_STATE_CMD(class MFD_AVC_DPB_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 27;   /*     0     0 */
		static const size_t               byteSize = 108; /*     0     0 */

		/* size: 108, cachelines: 2, members: 7, static members: 2 */
		/* last cacheline: 44 bytes */
	};

	struct MFD_AVC_SLICEADDR_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataLength; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataStartAddress:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataLength; /*     4     4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataStartAddress:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		void MFD_AVC_SLICEADDR_CMD(class MFD_AVC_SLICEADDR_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 3;    /*     0     0 */
		static const size_t               byteSize = 12; /*     0     0 */

		/* size: 12, cachelines: 1, members: 3, static members: 2 */
		/* last cacheline: 12 bytes */
	};

	struct MFD_AVC_BSD_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataLength; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataStartAddress:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MbErrorConcealmentPSliceWeightPredictionDisableFlag:1; /*     0: 0  4 */
				uint32_t           MbErrorConcealmentPSliceMotionVectorsOverrideDisableFlag:1; /*     0: 1  4 */
				uint32_t           Reserved98:1;         /*     0: 2  4 */
				uint32_t           MbErrorConcealmentBSpatialWeightPredictionDisableFlag:1; /*     0: 3  4 */
				uint32_t           MbErrorConcealmentBSpatialMotionVectorsOverrideDisableFlag:1; /*     0: 4  4 */
				uint32_t           Reserved101:1;        /*     0: 5  4 */
				uint32_t           MbErrorConcealmentBSpatialPredictionMode:2; /*     0: 6  4 */
				uint32_t           MbHeaderErrorHandling:1; /*     0: 8  4 */
				uint32_t           Reserved105:1;        /*     0: 9  4 */
				uint32_t           EntropyErrorHandling:1; /*     0:10  4 */
				uint32_t           Reserved107:1;        /*     0:11  4 */
				uint32_t           MprErrorMvOutOfRangeHandling:1; /*     0:12  4 */
				uint32_t           Reserved109:1;        /*     0:13  4 */
				uint32_t           BsdPrematureCompleteErrorHandling:1; /*     0:14  4 */
				uint32_t           Reserved111:1;        /*     0:15  4 */
				uint32_t           ConcealmentPictureId:6; /*     0:16  4 */
				uint32_t           Reserved118:2;        /*     0:22  4 */
				uint32_t           MbErrorConcealmentBTemporalWeightPredictionDisableFlag:1; /*     0:24  4 */
				uint32_t           MbErrorConcealmentBTemporalMotionVectorsOverrideEnableFlag:1; /*     0:25  4 */
				uint32_t           Reserved122:1;        /*     0:26  4 */
				uint32_t           MbErrorConcealmentBTemporalPredictionMode:2; /*     0:27  4 */
				uint32_t           IntraPredmode4X48X8LumaErrorControlBit:1; /*     0:29  4 */
				uint32_t           InitCurrentMbNumber:1; /*     0:30  4 */
				uint32_t           ConcealmentMethod:1;  /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FirstMacroblockMbBitOffset:3; /*     0: 0  4 */
				uint32_t           LastsliceFlag:1;      /*     0: 3  4 */
				uint32_t           EmulationPreventionBytePresent:1; /*     0: 4  4 */
				uint32_t           Reserved133:2;        /*     0: 5  4 */
				uint32_t           FixPrevMbSkipped:1;   /*     0: 7  4 */
				uint32_t           Reserved136:8;        /*     0: 8  4 */
				uint32_t           FirstMbByteOffsetOfSliceDataOrSliceHeader:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntraPredictionErrorControlBitAppliedToIntra16X16Intra8X8Intra4X4LumaAndChroma:1; /*     0: 0  4 */
				uint32_t           Intra8X84X4PredictionErrorConcealmentControlBit:1; /*     0: 1  4 */
				uint32_t           Reserved162:2;        /*     0: 2  4 */
				uint32_t           BSliceTemporalInterConcealmentMode:3; /*     0: 4  4 */
				uint32_t           Reserved167:1;        /*     0: 7  4 */
				uint32_t           BSliceSpatialInterConcealmentMode:3; /*     0: 8  4 */
				uint32_t           Reserved171:1;        /*     0:11  4 */
				uint32_t           BSliceInterDirectTypeConcealmentMode:2; /*     0:12  4 */
				uint32_t           Reserved174:1;        /*     0:14  4 */
				uint32_t           BSliceConcealmentMode:1; /*     0:15  4 */
				uint32_t           PSliceInterConcealmentMode:3; /*     0:16  4 */
				uint32_t           Reserved179:4;        /*     0:19  4 */
				uint32_t           PSliceConcealmentMode:1; /*     0:23  4 */
				uint32_t           ConcealmentReferencePictureFieldBit:6; /*     0:24  4 */
				uint32_t           Reserved190:1;        /*     0:30  4 */
				uint32_t           ISliceConcealmentMode:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataLength; /*     4     4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataStartAddress:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MbErrorConcealmentPSliceWeightPredictionDisableFlag:1; /*    12: 0  4 */
				uint32_t   MbErrorConcealmentPSliceMotionVectorsOverrideDisableFlag:1; /*    12: 1  4 */
				uint32_t   Reserved98:1;         /*    12: 2  4 */
				uint32_t   MbErrorConcealmentBSpatialWeightPredictionDisableFlag:1; /*    12: 3  4 */
				uint32_t   MbErrorConcealmentBSpatialMotionVectorsOverrideDisableFlag:1; /*    12: 4  4 */
				uint32_t   Reserved101:1;        /*    12: 5  4 */
				uint32_t   MbErrorConcealmentBSpatialPredictionMode:2; /*    12: 6  4 */
				uint32_t   MbHeaderErrorHandling:1; /*    12: 8  4 */
				uint32_t   Reserved105:1;        /*    12: 9  4 */
				uint32_t   EntropyErrorHandling:1; /*    12:10  4 */
				uint32_t   Reserved107:1;        /*    12:11  4 */
				uint32_t   MprErrorMvOutOfRangeHandling:1; /*    12:12  4 */
				uint32_t   Reserved109:1;        /*    12:13  4 */
				uint32_t   BsdPrematureCompleteErrorHandling:1; /*    12:14  4 */
				uint32_t   Reserved111:1;        /*    12:15  4 */
				uint32_t   ConcealmentPictureId:6; /*    12:16  4 */
				uint32_t   Reserved118:2;        /*    12:22  4 */
				uint32_t   MbErrorConcealmentBTemporalWeightPredictionDisableFlag:1; /*    12:24  4 */
				uint32_t   MbErrorConcealmentBTemporalMotionVectorsOverrideEnableFlag:1; /*    12:25  4 */
				uint32_t   Reserved122:1;        /*    12:26  4 */
				uint32_t   MbErrorConcealmentBTemporalPredictionMode:2; /*    12:27  4 */
				uint32_t   IntraPredmode4X48X8LumaErrorControlBit:1; /*    12:29  4 */
				uint32_t   InitCurrentMbNumber:1; /*    12:30  4 */
				uint32_t   ConcealmentMethod:1;  /*    12:31  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   FirstMacroblockMbBitOffset:3; /*    16: 0  4 */
				uint32_t   LastsliceFlag:1;      /*    16: 3  4 */
				uint32_t   EmulationPreventionBytePresent:1; /*    16: 4  4 */
				uint32_t   Reserved133:2;        /*    16: 5  4 */
				uint32_t   FixPrevMbSkipped:1;   /*    16: 7  4 */
				uint32_t   Reserved136:8;        /*    16: 8  4 */
				uint32_t   FirstMbByteOffsetOfSliceDataOrSliceHeader:16; /*    16:16  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   IntraPredictionErrorControlBitAppliedToIntra16X16Intra8X8Intra4X4LumaAndChroma:1; /*    20: 0  4 */
				uint32_t   Intra8X84X4PredictionErrorConcealmentControlBit:1; /*    20: 1  4 */
				uint32_t   Reserved162:2;        /*    20: 2  4 */
				uint32_t   BSliceTemporalInterConcealmentMode:3; /*    20: 4  4 */
				uint32_t   Reserved167:1;        /*    20: 7  4 */
				uint32_t   BSliceSpatialInterConcealmentMode:3; /*    20: 8  4 */
				uint32_t   Reserved171:1;        /*    20:11  4 */
				uint32_t   BSliceInterDirectTypeConcealmentMode:2; /*    20:12  4 */
				uint32_t   Reserved174:1;        /*    20:14  4 */
				uint32_t   BSliceConcealmentMode:1; /*    20:15  4 */
				uint32_t   PSliceInterConcealmentMode:3; /*    20:16  4 */
				uint32_t   Reserved179:4;        /*    20:19  4 */
				uint32_t   PSliceConcealmentMode:1; /*    20:23  4 */
				uint32_t   ConcealmentReferencePictureFieldBit:6; /*    20:24  4 */
				uint32_t   Reserved190:1;        /*    20:30  4 */
				uint32_t   ISliceConcealmentMode:1; /*    20:31  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFD_AVC_BSD_OBJECT_CMD(class MFD_AVC_BSD_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFX_PAK_INSERT_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           BitstreamstartresetResetbitstreamstartingpos:1; /*     0: 0  4 */
				uint32_t           EndofsliceflagLastdstdatainsertcommandflag:1; /*     0: 1  4 */
				uint32_t           LastheaderflagLastsrcheaderdatainsertcommandflag:1; /*     0: 2  4 */
				uint32_t           EmulationflagEmulationbytebitsinsertenable:1; /*     0: 3  4 */
				uint32_t           SkipemulbytecntSkipEmulationByteCount:4; /*     0: 4  4 */
				uint32_t           DatabitsinlastdwSrcdataendingbitinclusion50:6; /*     0: 8  4 */
				uint32_t           SliceHeaderIndicator:1; /*     0:14  4 */
				uint32_t           Headerlengthexcludefrmsize:1; /*     0:15  4 */
				uint32_t           DatabyteoffsetSrcdatastartingbyteoffset10:2; /*     0:16  4 */
				uint32_t           Reserved50:14;        /*     0:18  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   BitstreamstartresetResetbitstreamstartingpos:1; /*     4: 0  4 */
				uint32_t   EndofsliceflagLastdstdatainsertcommandflag:1; /*     4: 1  4 */
				uint32_t   LastheaderflagLastsrcheaderdatainsertcommandflag:1; /*     4: 2  4 */
				uint32_t   EmulationflagEmulationbytebitsinsertenable:1; /*     4: 3  4 */
				uint32_t   SkipemulbytecntSkipEmulationByteCount:4; /*     4: 4  4 */
				uint32_t   DatabitsinlastdwSrcdataendingbitinclusion50:6; /*     4: 8  4 */
				uint32_t   SliceHeaderIndicator:1; /*     4:14  4 */
				uint32_t   Headerlengthexcludefrmsize:1; /*     4:15  4 */
				uint32_t   DatabyteoffsetSrcdatastartingbyteoffset10:2; /*     4:16  4 */
				uint32_t   Reserved50:14;        /*     4:18  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		void MFX_PAK_INSERT_OBJECT_CMD(class MFX_PAK_INSERT_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 2;    /*     0     0 */
		static const size_t               byteSize = 8;  /*     0     0 */

		/* size: 8, cachelines: 1, members: 2, static members: 2 */
		/* last cacheline: 8 bytes */
	};

	struct MFX_MPEG2_PIC_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:6;         /*     0: 0  4 */
				uint32_t           ScanOrder:1;          /*     0: 6  4 */
				uint32_t           IntraVlcFormat:1;     /*     0: 7  4 */
				uint32_t           QuantizerScaleType:1; /*     0: 8  4 */
				uint32_t           ConcealmentMotionVectorFlag:1; /*     0: 9  4 */
				uint32_t           FramePredictionFrameDct:1; /*     0:10  4 */
				uint32_t           TffTopFieldFirst:1;   /*     0:11  4 */
				uint32_t           PictureStructure:2;   /*     0:12  4 */
				uint32_t           IntraDcPrecision:2;   /*     0:14  4 */
				uint32_t           FCode00:4;            /*     0:16  4 */
				uint32_t           FCode01:4;            /*     0:20  4 */
				uint32_t           FCode10:4;            /*     0:24  4 */
				uint32_t           FCode11:4;            /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           DisableMismatch:1;    /*     0: 0  4 */
				uint32_t           Mismatchcontroldisabled:1; /*     0: 1  4 */
				uint32_t           Reserved66:7;         /*     0: 2  4 */
				uint32_t           PictureCodingType:2;  /*     0: 9  4 */
				uint32_t           Reserved75:3;         /*     0:11  4 */
				uint32_t           LoadslicepointerflagLoadbitstreampointerperslice:1; /*     0:14  4 */
				uint32_t           Reserved79:9;         /*     0:15  4 */
				uint32_t           PBSlicePredictedMotionVectorOverrideFinalMvValueOverride:1; /*     0:24  4 */
				uint32_t           PBSlicePredictedBidirMotionTypeOverrideBiDirectionMvTypeOverride:2; /*     0:25  4 */
				uint32_t           Reserved91:1;         /*     0:27  4 */
				uint32_t           PBSliceConcealmentMode:2; /*     0:28  4 */
				uint32_t           Reserved94:1;         /*     0:30  4 */
				uint32_t           ISliceConcealmentMode:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Framewidthinmbsminus170PictureWidthInMacroblocks:8; /*     0: 0  4 */
				uint32_t           Reserved104:8;        /*     0: 8  4 */
				uint32_t           Frameheightinmbsminus170PictureHeightInMacroblocks:8; /*     0:16  4 */
				uint32_t           Reserved120:7;        /*     0:24  4 */
				uint32_t           SliceConcealmentDisableBit:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128:1;        /*     0: 0  4 */
				uint32_t           Roundintradc:2;       /*     0: 1  4 */
				uint32_t           Reserved131:1;        /*     0: 3  4 */
				uint32_t           Roundinterdc:3;       /*     0: 4  4 */
				uint32_t           Reserved135:1;        /*     0: 7  4 */
				uint32_t           Roundintraac:3;       /*     0: 8  4 */
				uint32_t           Reserved139:1;        /*     0:11  4 */
				uint32_t           Roundinterac:3;       /*     0:12  4 */
				uint32_t           Mbstatenabled:1;      /*     0:15  4 */
				uint32_t           Minframewsize:16;     /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Intrambmaxsizereportmask:1; /*     0: 0  4 */
				uint32_t           Intermbmaxsizereportmask:1; /*     0: 1  4 */
				uint32_t           Framebitratemaxreportmask:1; /*     0: 2  4 */
				uint32_t           Framebitrateminreportmask:1; /*     0: 3  4 */
				uint32_t           Reserved164:5;        /*     0: 4  4 */
				uint32_t           Mbratecontrolmask:1;  /*     0: 9  4 */
				uint32_t           Minframewsizeunits:2; /*     0:10  4 */
				uint32_t           Intermbforcecbpzerocontrolmask:1; /*     0:12  4 */
				uint32_t           Reserved173:3;        /*     0:13  4 */
				uint32_t           Framesizecontrolmask:1; /*     0:16  4 */
				uint32_t           Reserved177:15;       /*     0:17  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Intrambmaxsize:12;    /*     0: 0  4 */
				uint32_t           Reserved204:4;        /*     0:12  4 */
				uint32_t           Intermbmaxsize:12;    /*     0:16  4 */
				uint32_t           Reserved220:4;        /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           VslTopMbTrans8X8Flag:1; /*     0: 0  4 */
				uint32_t           Reserved225:31;       /*     0: 1  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Slicedeltaqpmax0:8;   /*     0: 0  4 */
				uint32_t           Slicedeltaqpmax1:8;   /*     0: 8  4 */
				uint32_t           Slicedeltaqpmax2:8;   /*     0:16  4 */
				uint32_t           Slicedeltaqpmax3:8;   /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Slicedeltaqpmin0:8;   /*     0: 0  4 */
				uint32_t           Slicedeltaqpmin1:8;   /*     0: 8  4 */
				uint32_t           Slicedeltaqpmin2:8;   /*     0:16  4 */
				uint32_t           Slicedeltaqpmin3:8;   /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Framebitratemin:14;   /*     0: 0  4 */
				uint32_t           Framebitrateminunitmode:1; /*     0:14  4 */
				uint32_t           Framebitrateminunit:1; /*     0:15  4 */
				uint32_t           Framebitratemax:14;   /*     0:16  4 */
				uint32_t           Framebitratemaxunitmode:1; /*     0:30  4 */
				uint32_t           Framebitratemaxunit:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Framebitratemindelta:15; /*     0: 0  4 */
				uint32_t           Reserved367:1;        /*     0:15  4 */
				uint32_t           Framebitratemaxdelta:15; /*     0:16  4 */
				uint32_t           Reserved383:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved384:32;       /*     0: 0  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:6;         /*     4: 0  4 */
				uint32_t   ScanOrder:1;          /*     4: 6  4 */
				uint32_t   IntraVlcFormat:1;     /*     4: 7  4 */
				uint32_t   QuantizerScaleType:1; /*     4: 8  4 */
				uint32_t   ConcealmentMotionVectorFlag:1; /*     4: 9  4 */
				uint32_t   FramePredictionFrameDct:1; /*     4:10  4 */
				uint32_t   TffTopFieldFirst:1;   /*     4:11  4 */
				uint32_t   PictureStructure:2;   /*     4:12  4 */
				uint32_t   IntraDcPrecision:2;   /*     4:14  4 */
				uint32_t   FCode00:4;            /*     4:16  4 */
				uint32_t   FCode01:4;            /*     4:20  4 */
				uint32_t   FCode10:4;            /*     4:24  4 */
				uint32_t   FCode11:4;            /*     4:28  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   DisableMismatch:1;    /*     8: 0  4 */
				uint32_t   Mismatchcontroldisabled:1; /*     8: 1  4 */
				uint32_t   Reserved66:7;         /*     8: 2  4 */
				uint32_t   PictureCodingType:2;  /*     8: 9  4 */
				uint32_t   Reserved75:3;         /*     8:11  4 */
				uint32_t   LoadslicepointerflagLoadbitstreampointerperslice:1; /*     8:14  4 */
				uint32_t   Reserved79:9;         /*     8:15  4 */
				uint32_t   PBSlicePredictedMotionVectorOverrideFinalMvValueOverride:1; /*     8:24  4 */
				uint32_t   PBSlicePredictedBidirMotionTypeOverrideBiDirectionMvTypeOverride:2; /*     8:25  4 */
				uint32_t   Reserved91:1;         /*     8:27  4 */
				uint32_t   PBSliceConcealmentMode:2; /*     8:28  4 */
				uint32_t   Reserved94:1;         /*     8:30  4 */
				uint32_t   ISliceConcealmentMode:1; /*     8:31  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Framewidthinmbsminus170PictureWidthInMacroblocks:8; /*    12: 0  4 */
				uint32_t   Reserved104:8;        /*    12: 8  4 */
				uint32_t   Frameheightinmbsminus170PictureHeightInMacroblocks:8; /*    12:16  4 */
				uint32_t   Reserved120:7;        /*    12:24  4 */
				uint32_t   SliceConcealmentDisableBit:1; /*    12:31  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128:1;        /*    16: 0  4 */
				uint32_t   Roundintradc:2;       /*    16: 1  4 */
				uint32_t   Reserved131:1;        /*    16: 3  4 */
				uint32_t   Roundinterdc:3;       /*    16: 4  4 */
				uint32_t   Reserved135:1;        /*    16: 7  4 */
				uint32_t   Roundintraac:3;       /*    16: 8  4 */
				uint32_t   Reserved139:1;        /*    16:11  4 */
				uint32_t   Roundinterac:3;       /*    16:12  4 */
				uint32_t   Mbstatenabled:1;      /*    16:15  4 */
				uint32_t   Minframewsize:16;     /*    16:16  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   Intrambmaxsizereportmask:1; /*    20: 0  4 */
				uint32_t   Intermbmaxsizereportmask:1; /*    20: 1  4 */
				uint32_t   Framebitratemaxreportmask:1; /*    20: 2  4 */
				uint32_t   Framebitrateminreportmask:1; /*    20: 3  4 */
				uint32_t   Reserved164:5;        /*    20: 4  4 */
				uint32_t   Mbratecontrolmask:1;  /*    20: 9  4 */
				uint32_t   Minframewsizeunits:2; /*    20:10  4 */
				uint32_t   Intermbforcecbpzerocontrolmask:1; /*    20:12  4 */
				uint32_t   Reserved173:3;        /*    20:13  4 */
				uint32_t   Framesizecontrolmask:1; /*    20:16  4 */
				uint32_t   Reserved177:15;       /*    20:17  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   Intrambmaxsize:12;    /*    24: 0  4 */
				uint32_t   Reserved204:4;        /*    24:12  4 */
				uint32_t   Intermbmaxsize:12;    /*    24:16  4 */
				uint32_t   Reserved220:4;        /*    24:28  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   VslTopMbTrans8X8Flag:1; /*    28: 0  4 */
				uint32_t   Reserved225:31;       /*    28: 1  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   Slicedeltaqpmax0:8;   /*    32: 0  4 */
				uint32_t   Slicedeltaqpmax1:8;   /*    32: 8  4 */
				uint32_t   Slicedeltaqpmax2:8;   /*    32:16  4 */
				uint32_t   Slicedeltaqpmax3:8;   /*    32:24  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   Slicedeltaqpmin0:8;   /*    36: 0  4 */
				uint32_t   Slicedeltaqpmin1:8;   /*    36: 8  4 */
				uint32_t   Slicedeltaqpmin2:8;   /*    36:16  4 */
				uint32_t   Slicedeltaqpmin3:8;   /*    36:24  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   Framebitratemin:14;   /*    40: 0  4 */
				uint32_t   Framebitrateminunitmode:1; /*    40:14  4 */
				uint32_t   Framebitrateminunit:1; /*    40:15  4 */
				uint32_t   Framebitratemax:14;   /*    40:16  4 */
				uint32_t   Framebitratemaxunitmode:1; /*    40:30  4 */
				uint32_t   Framebitratemaxunit:1; /*    40:31  4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   Framebitratemindelta:15; /*    44: 0  4 */
				uint32_t   Reserved367:1;        /*    44:15  4 */
				uint32_t   Framebitratemaxdelta:15; /*    44:16  4 */
				uint32_t   Reserved383:1;        /*    44:31  4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   Reserved384:32;       /*    48: 0  4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		void MFX_MPEG2_PIC_STATE_CMD(class MFX_MPEG2_PIC_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 13;   /*     0     0 */
		static const size_t               byteSize = 52; /*     0     0 */

		/* size: 52, cachelines: 1, members: 13, static members: 2 */
		/* last cacheline: 52 bytes */
	};

	struct MFD_MPEG2_BSD_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataLength; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectDataStartAddress:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FirstMacroblockBitOffset:3; /*     0: 0  4 */
				uint32_t           IsLastMb:1;           /*     0: 3  4 */
				uint32_t           Reserved100:1;        /*     0: 4  4 */
				uint32_t           LastPicSlice:1;       /*     0: 5  4 */
				uint32_t           SliceConcealmentTypeBit:1; /*     0: 6  4 */
				uint32_t           SliceConcealmentOverrideBit:1; /*     0: 7  4 */
				uint32_t           MacroblockCount:8;    /*     0: 8  4 */
				uint32_t           SliceVerticalPosition:8; /*     0:16  4 */
				uint32_t           SliceHorizontalPosition:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           NextSliceHorizontalPosition:8; /*     0: 0  4 */
				uint32_t           NextSliceVerticalPosition:9; /*     0: 8  4 */
				uint32_t           Reserved145:7;        /*     0:17  4 */
				uint32_t           QuantizerScaleCode:5; /*     0:24  4 */
				uint32_t           Reserved157:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataLength; /*     4     4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectDataStartAddress:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   FirstMacroblockBitOffset:3; /*    12: 0  4 */
				uint32_t   IsLastMb:1;           /*    12: 3  4 */
				uint32_t   Reserved100:1;        /*    12: 4  4 */
				uint32_t   LastPicSlice:1;       /*    12: 5  4 */
				uint32_t   SliceConcealmentTypeBit:1; /*    12: 6  4 */
				uint32_t   SliceConcealmentOverrideBit:1; /*    12: 7  4 */
				uint32_t   MacroblockCount:8;    /*    12: 8  4 */
				uint32_t   SliceVerticalPosition:8; /*    12:16  4 */
				uint32_t   SliceHorizontalPosition:8; /*    12:24  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   NextSliceHorizontalPosition:8; /*    16: 0  4 */
				uint32_t   NextSliceVerticalPosition:9; /*    16: 8  4 */
				uint32_t   Reserved145:7;        /*    16:17  4 */
				uint32_t   QuantizerScaleCode:5; /*    16:24  4 */
				uint32_t   Reserved157:3;        /*    16:29  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		void MFD_MPEG2_BSD_OBJECT_CMD(class MFD_MPEG2_BSD_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 5;    /*     0     0 */
		static const size_t               byteSize = 20; /*     0     0 */

		/* size: 20, cachelines: 1, members: 5, static members: 2 */
		/* last cacheline: 20 bytes */
	};

	struct MFD_IT_OBJECT_MPEG2_INLINE_DATA_CMD {
		union {
			struct {
				uint32_t           Reserved0:3;          /*     0: 0  4 */
				uint32_t           Lastmbinrow:1;        /*     0: 3  4 */
				uint32_t           Reserved4:2;          /*     0: 4  4 */
				uint32_t           CodedBlockPattern:6;  /*     0: 6  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           MacroblockIntraType:1; /*     0:16  4 */
				uint32_t           MacroblockMotionForward:1; /*     0:17  4 */
				uint32_t           MacroblockMotionBackward:1; /*     0:18  4 */
				uint32_t           Reserved19:2;         /*     0:19  4 */
				uint32_t           DctType:1;            /*     0:21  4 */
				uint32_t           Reserved22:2;         /*     0:22  4 */
				uint32_t           MotionType:2;         /*     0:24  4 */
				uint32_t           Reserved26:2;         /*     0:26  4 */
				uint32_t           MotionVerticalFieldSelect:4; /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Horzorigin:8;         /*     0: 0  4 */
				uint32_t           Vertorigin:8;         /*     0: 8  4 */
				uint32_t           Reserved48:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MotionVectorsField0ForwardHorizontalComponent:16; /*     0: 0  4 */
				uint32_t           MotionVectorsField0ForwardVerticalComponent:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MotionVectorsField0BackwardHorizontalComponent:16; /*     0: 0  4 */
				uint32_t           MotionVectorsField0BackwardVerticalComponent:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MotionVectorsField1ForwardHorizontalComponent:16; /*     0: 0  4 */
				uint32_t           MotionVectorsField1ForwardVerticalComponent:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MotionVectorsField1BackwardHorizontalComponent:16; /*     0: 0  4 */
				uint32_t           MotionVectorsField1BackwardVerticalComponent:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   Reserved0:3;          /*     0: 0  4 */
				uint32_t   Lastmbinrow:1;        /*     0: 3  4 */
				uint32_t   Reserved4:2;          /*     0: 4  4 */
				uint32_t   CodedBlockPattern:6;  /*     0: 6  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   MacroblockIntraType:1; /*     0:16  4 */
				uint32_t   MacroblockMotionForward:1; /*     0:17  4 */
				uint32_t   MacroblockMotionBackward:1; /*     0:18  4 */
				uint32_t   Reserved19:2;         /*     0:19  4 */
				uint32_t   DctType:1;            /*     0:21  4 */
				uint32_t   Reserved22:2;         /*     0:22  4 */
				uint32_t   MotionType:2;         /*     0:24  4 */
				uint32_t   Reserved26:2;         /*     0:26  4 */
				uint32_t   MotionVerticalFieldSelect:4; /*     0:28  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Horzorigin:8;         /*     4: 0  4 */
				uint32_t   Vertorigin:8;         /*     4: 8  4 */
				uint32_t   Reserved48:16;        /*     4:16  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   MotionVectorsField0ForwardHorizontalComponent:16; /*     8: 0  4 */
				uint32_t   MotionVectorsField0ForwardVerticalComponent:16; /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MotionVectorsField0BackwardHorizontalComponent:16; /*    12: 0  4 */
				uint32_t   MotionVectorsField0BackwardVerticalComponent:16; /*    12:16  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   MotionVectorsField1ForwardHorizontalComponent:16; /*    16: 0  4 */
				uint32_t   MotionVectorsField1ForwardVerticalComponent:16; /*    16:16  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   MotionVectorsField1BackwardHorizontalComponent:16; /*    20: 0  4 */
				uint32_t   MotionVectorsField1BackwardVerticalComponent:16; /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFD_IT_OBJECT_MPEG2_INLINE_DATA_CMD(class MFD_IT_OBJECT_MPEG2_INLINE_DATA_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFD_IT_OBJECT_VC1_INLINE_DATA_CMD {
		union {
			struct {
				uint32_t           Reserved0:3;          /*     0: 0  4 */
				uint32_t           Lastmbinrow:1;        /*     0: 3  4 */
				uint32_t           LastRowFlag:1;        /*     0: 4  4 */
				uint32_t           ChromaIntraFlag:1;    /*     0: 5  4 */
				uint32_t           CodedBlockPattern:6;  /*     0: 6  4 */
				uint32_t           LumaIntra8X8Flag:4;   /*     0:12  4 */
				uint32_t           MacroblockIntraType:1; /*     0:16  4 */
				uint32_t           MacroblockMotionForward:1; /*     0:17  4 */
				uint32_t           MacroblockMotionBackward:1; /*     0:18  4 */
				uint32_t           Motion4Mv:1;          /*     0:19  4 */
				uint32_t           Overlaptransform:1;   /*     0:20  4 */
				uint32_t           DctType:1;            /*     0:21  4 */
				uint32_t           Mvswitch:1;           /*     0:22  4 */
				uint32_t           Reserved23:1;         /*     0:23  4 */
				uint32_t           MotionType:2;         /*     0:24  4 */
				uint32_t           Mvfieldselectchroma:1; /*     0:26  4 */
				uint32_t           Reserved27:1;         /*     0:27  4 */
				uint32_t           MotionVerticalFieldSelect:4; /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Horzorigin:8;         /*     0: 0  4 */
				uint32_t           Vertorigin:8;         /*     0: 8  4 */
				uint32_t           Osedgemaskluma:8;     /*     0:16  4 */
				uint32_t           Osedgemaskchroma:2;   /*     0:24  4 */
				uint32_t           Reserved58:6;         /*     0:26  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MotionVectorsField0ForwardHorizontalComponent:16; /*     0: 0  4 */
				uint32_t           MotionVectorsField0ForwardVerticalComponent:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Motionvector1;        /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Motionvector2;        /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Motionvector3;        /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Motionvectorchroma;   /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SubblockCodeForY0:8;  /*     0: 0  4 */
				uint32_t           SubblockCodeForY1:8;  /*     0: 8  4 */
				uint32_t           SubblockCodeForY2:8;  /*     0:16  4 */
				uint32_t           SubblockCodeForY3:8;  /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           SubblockCodeForCb:8;  /*     0: 0  4 */
				uint32_t           SubblockCodeForCr:8;  /*     0: 8  4 */
				uint32_t           Reserved272:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IldbControlDataForBlockY0:8; /*     0: 0  4 */
				uint32_t           IldbControlDataForBlockY1:8; /*     0: 8  4 */
				uint32_t           IldbControlDataForBlockY2:8; /*     0:16  4 */
				uint32_t           IldbControlDataForBlockY3:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IldbControlDataForCbBlock:8; /*     0: 0  4 */
				uint32_t           IldbControlDataForCrBlock:8; /*     0: 8  4 */
				uint32_t           Reserved336:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   Reserved0:3;          /*     0: 0  4 */
				uint32_t   Lastmbinrow:1;        /*     0: 3  4 */
				uint32_t   LastRowFlag:1;        /*     0: 4  4 */
				uint32_t   ChromaIntraFlag:1;    /*     0: 5  4 */
				uint32_t   CodedBlockPattern:6;  /*     0: 6  4 */
				uint32_t   LumaIntra8X8Flag:4;   /*     0:12  4 */
				uint32_t   MacroblockIntraType:1; /*     0:16  4 */
				uint32_t   MacroblockMotionForward:1; /*     0:17  4 */
				uint32_t   MacroblockMotionBackward:1; /*     0:18  4 */
				uint32_t   Motion4Mv:1;          /*     0:19  4 */
				uint32_t   Overlaptransform:1;   /*     0:20  4 */
				uint32_t   DctType:1;            /*     0:21  4 */
				uint32_t   Mvswitch:1;           /*     0:22  4 */
				uint32_t   Reserved23:1;         /*     0:23  4 */
				uint32_t   MotionType:2;         /*     0:24  4 */
				uint32_t   Mvfieldselectchroma:1; /*     0:26  4 */
				uint32_t   Reserved27:1;         /*     0:27  4 */
				uint32_t   MotionVerticalFieldSelect:4; /*     0:28  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Horzorigin:8;         /*     4: 0  4 */
				uint32_t   Vertorigin:8;         /*     4: 8  4 */
				uint32_t   Osedgemaskluma:8;     /*     4:16  4 */
				uint32_t   Osedgemaskchroma:2;   /*     4:24  4 */
				uint32_t   Reserved58:6;         /*     4:26  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   MotionVectorsField0ForwardHorizontalComponent:16; /*     8: 0  4 */
				uint32_t   MotionVectorsField0ForwardVerticalComponent:16; /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Motionvector1;        /*    12     4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Motionvector2;        /*    16     4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   Motionvector3;        /*    20     4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   Motionvectorchroma;   /*    24     4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   SubblockCodeForY0:8;  /*    28: 0  4 */
				uint32_t   SubblockCodeForY1:8;  /*    28: 8  4 */
				uint32_t   SubblockCodeForY2:8;  /*    28:16  4 */
				uint32_t   SubblockCodeForY3:8;  /*    28:24  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   SubblockCodeForCb:8;  /*    32: 0  4 */
				uint32_t   SubblockCodeForCr:8;  /*    32: 8  4 */
				uint32_t   Reserved272:16;       /*    32:16  4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   IldbControlDataForBlockY0:8; /*    36: 0  4 */
				uint32_t   IldbControlDataForBlockY1:8; /*    36: 8  4 */
				uint32_t   IldbControlDataForBlockY2:8; /*    36:16  4 */
				uint32_t   IldbControlDataForBlockY3:8; /*    36:24  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   IldbControlDataForCbBlock:8; /*    40: 0  4 */
				uint32_t   IldbControlDataForCrBlock:8; /*    40: 8  4 */
				uint32_t   Reserved336:16;       /*    40:16  4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		void MFD_IT_OBJECT_VC1_INLINE_DATA_CMD(class MFD_IT_OBJECT_VC1_INLINE_DATA_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 11;   /*     0     0 */
		static const size_t               byteSize = 44; /*     0     0 */

		/* size: 44, cachelines: 1, members: 11, static members: 2 */
		/* last cacheline: 44 bytes */
	};

	struct MFD_IT_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItMvDataLength:10; /*     0: 0  4 */
				uint32_t           Reserved42:22;        /*     0:10  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItMvDataStartAddressOffset:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItCoeffDataLength:12; /*     0: 0  4 */
				uint32_t           Reserved108:20;       /*     0:12  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItCoeffDataStartAddressOffset:29; /*     0: 0  4 */
				uint32_t           Reserved157:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItDblkControlDataLength:6; /*     0: 0  4 */
				uint32_t           Reserved166:26;       /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectItDblkControlDataStartAddressOffset:29; /*     0: 0  4 */
				uint32_t           Reserved221:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectItMvDataLength:10; /*     4: 0  4 */
				uint32_t   Reserved42:22;        /*     4:10  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectItMvDataStartAddressOffset:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   IndirectItCoeffDataLength:12; /*    12: 0  4 */
				uint32_t   Reserved108:20;       /*    12:12  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   IndirectItCoeffDataStartAddressOffset:29; /*    16: 0  4 */
				uint32_t   Reserved157:3;        /*    16:29  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   IndirectItDblkControlDataLength:6; /*    20: 0  4 */
				uint32_t   Reserved166:26;       /*    20: 6  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   IndirectItDblkControlDataStartAddressOffset:29; /*    24: 0  4 */
				uint32_t   Reserved221:3;        /*    24:29  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		void MFD_IT_OBJECT_CMD(class MFD_IT_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 7;    /*     0     0 */
		static const size_t               byteSize = 28; /*     0     0 */

		/* size: 28, cachelines: 1, members: 7, static members: 2 */
		/* last cacheline: 28 bytes */
	};

	struct MFC_MPEG2_SLICEGROUP_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Streamid10EncoderOnly:2; /*     0: 0  4 */
				uint32_t           Reserved34:2;         /*     0: 2  4 */
				uint32_t           Sliceid30EncoderOnly:4; /*     0: 4  4 */
				uint32_t           Reserved40:4;         /*     0: 8  4 */
				uint32_t           Intrasliceflag:1;     /*     0:12  4 */
				uint32_t           Intraslice:1;         /*     0:13  4 */
				uint32_t           Firstslicehdrdisabled:1; /*     0:14  4 */
				uint32_t           TailpresentflagTailInsertionPresentInBitstreamEncoderOnly:1; /*     0:15  4 */
				uint32_t           SlicedataPresentflagSlicedataInsertionPresentInBitstreamEncoderOnly:1; /*     0:16  4 */
				uint32_t           HeaderpresentflagHeaderInsertionPresentInBitstreamEncoderOnly:1; /*     0:17  4 */
				uint32_t           BitstreamoutputflagCompressedBitstreamOutputDisableFlagEncoderOnly:1; /*     0:18  4 */
				uint32_t           Islastslicegrp:1;     /*     0:19  4 */
				uint32_t           SkipconvdisabledMbTypeSkipConversionDisableEncoderOnly:1; /*     0:20  4 */
				uint32_t           Reserved53:1;         /*     0:21  4 */
				uint32_t           RatectrlpanictypeRcPanicTypeEncoderOnly:1; /*     0:22  4 */
				uint32_t           RatectrlpanicflagRcPanicEnableEncoderOnly:1; /*     0:23  4 */
				uint32_t           MbratectrlparamRcStableToleranceEncoderOnly:4; /*     0:24  4 */
				uint32_t           MbratectrlmodeRcTriggleModeEncoderOnly:2; /*     0:28  4 */
				uint32_t           MbratectrlresetResetratecontrolcounterEncoderOnly:1; /*     0:30  4 */
				uint32_t           MbratectrlflagRatecontrolcounterenableEncoderOnly:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FirstmbxcntAlsoCurrstarthorzpos:8; /*     0: 0  4 */
				uint32_t           FirstmbycntAlsoCurrstartvertpos:8; /*     0: 8  4 */
				uint32_t           NextsgmbxcntAlsoNextstarthorzpos:8; /*     0:16  4 */
				uint32_t           NextsgmbycntAlsoNextstartvertpos:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Slicegroupqp:6;       /*     0: 0  4 */
				uint32_t           Reserved102:2;        /*     0: 6  4 */
				uint32_t           Slicegroupskip:1;     /*     0: 8  4 */
				uint32_t           Reserved105:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           BitstreamoffsetIndirectPakBseDataStartAddressWrite:29; /*     0: 0  4 */
				uint32_t           Reserved157:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           GrowparamGrowInitEncoderOnly:4; /*     0: 0  4 */
				uint32_t           GrowparamGrowResistanceEncoderOnly:4; /*     0: 4  4 */
				uint32_t           ShrinkaramShrinkInitEncoderOnly:4; /*     0: 8  4 */
				uint32_t           ShrinkparamShrinkResistanceEncoderOnly:4; /*     0:12  4 */
				uint32_t           MaxqpposmodifierMagnitudeOfQpMaxPositiveModifierEncoderOnly:8; /*     0:16  4 */
				uint32_t           MaxqpnegmodifierMagnitudeOfQpMaxNegativeModifierEncoderOnly:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CorrectpointsCorrect1EncoderOnly:4; /*     0: 0  4 */
				uint32_t           CorrectpointsCorrect2EncoderOnly:4; /*     0: 4  4 */
				uint32_t           CorrectpointsCorrect3EncoderOnly:4; /*     0: 8  4 */
				uint32_t           CorrectpointsCorrect4EncoderOnly:4; /*     0:12  4 */
				uint32_t           CorrectpointsCorrect5EncoderOnly:4; /*     0:16  4 */
				uint32_t           CorrectpointsCorrect6EncoderOnly:4; /*     0:20  4 */
				uint32_t           Reserved216:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Cv0ClampValue0EncoderOnly:4; /*     0: 0  4 */
				uint32_t           Cv1ClampValue1EncoderOnly:4; /*     0: 4  4 */
				uint32_t           Cv2ClampValue2EncoderOnly:4; /*     0: 8  4 */
				uint32_t           Cv3ClampValue3EncoderOnly:4; /*     0:12  4 */
				uint32_t           Cv4ClampValue4EncoderOnly:4; /*     0:16  4 */
				uint32_t           Cv5ClampValue5EncoderOnly:4; /*     0:20  4 */
				uint32_t           Cv6ClampValue6EncoderOnly:4; /*     0:24  4 */
				uint32_t           Cv7ClampValue7EncoderOnly:4; /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Streamid10EncoderOnly:2; /*     4: 0  4 */
				uint32_t   Reserved34:2;         /*     4: 2  4 */
				uint32_t   Sliceid30EncoderOnly:4; /*     4: 4  4 */
				uint32_t   Reserved40:4;         /*     4: 8  4 */
				uint32_t   Intrasliceflag:1;     /*     4:12  4 */
				uint32_t   Intraslice:1;         /*     4:13  4 */
				uint32_t   Firstslicehdrdisabled:1; /*     4:14  4 */
				uint32_t   TailpresentflagTailInsertionPresentInBitstreamEncoderOnly:1; /*     4:15  4 */
				uint32_t   SlicedataPresentflagSlicedataInsertionPresentInBitstreamEncoderOnly:1; /*     4:16  4 */
				uint32_t   HeaderpresentflagHeaderInsertionPresentInBitstreamEncoderOnly:1; /*     4:17  4 */
				uint32_t   BitstreamoutputflagCompressedBitstreamOutputDisableFlagEncoderOnly:1; /*     4:18  4 */
				uint32_t   Islastslicegrp:1;     /*     4:19  4 */
				uint32_t   SkipconvdisabledMbTypeSkipConversionDisableEncoderOnly:1; /*     4:20  4 */
				uint32_t   Reserved53:1;         /*     4:21  4 */
				uint32_t   RatectrlpanictypeRcPanicTypeEncoderOnly:1; /*     4:22  4 */
				uint32_t   RatectrlpanicflagRcPanicEnableEncoderOnly:1; /*     4:23  4 */
				uint32_t   MbratectrlparamRcStableToleranceEncoderOnly:4; /*     4:24  4 */
				uint32_t   MbratectrlmodeRcTriggleModeEncoderOnly:2; /*     4:28  4 */
				uint32_t   MbratectrlresetResetratecontrolcounterEncoderOnly:1; /*     4:30  4 */
				uint32_t   MbratectrlflagRatecontrolcounterenableEncoderOnly:1; /*     4:31  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   FirstmbxcntAlsoCurrstarthorzpos:8; /*     8: 0  4 */
				uint32_t   FirstmbycntAlsoCurrstartvertpos:8; /*     8: 8  4 */
				uint32_t   NextsgmbxcntAlsoNextstarthorzpos:8; /*     8:16  4 */
				uint32_t   NextsgmbycntAlsoNextstartvertpos:8; /*     8:24  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Slicegroupqp:6;       /*    12: 0  4 */
				uint32_t   Reserved102:2;        /*    12: 6  4 */
				uint32_t   Slicegroupskip:1;     /*    12: 8  4 */
				uint32_t   Reserved105:23;       /*    12: 9  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   BitstreamoffsetIndirectPakBseDataStartAddressWrite:29; /*    16: 0  4 */
				uint32_t   Reserved157:3;        /*    16:29  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   GrowparamGrowInitEncoderOnly:4; /*    20: 0  4 */
				uint32_t   GrowparamGrowResistanceEncoderOnly:4; /*    20: 4  4 */
				uint32_t   ShrinkaramShrinkInitEncoderOnly:4; /*    20: 8  4 */
				uint32_t   ShrinkparamShrinkResistanceEncoderOnly:4; /*    20:12  4 */
				uint32_t   MaxqpposmodifierMagnitudeOfQpMaxPositiveModifierEncoderOnly:8; /*    20:16  4 */
				uint32_t   MaxqpnegmodifierMagnitudeOfQpMaxNegativeModifierEncoderOnly:8; /*    20:24  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   CorrectpointsCorrect1EncoderOnly:4; /*    24: 0  4 */
				uint32_t   CorrectpointsCorrect2EncoderOnly:4; /*    24: 4  4 */
				uint32_t   CorrectpointsCorrect3EncoderOnly:4; /*    24: 8  4 */
				uint32_t   CorrectpointsCorrect4EncoderOnly:4; /*    24:12  4 */
				uint32_t   CorrectpointsCorrect5EncoderOnly:4; /*    24:16  4 */
				uint32_t   CorrectpointsCorrect6EncoderOnly:4; /*    24:20  4 */
				uint32_t   Reserved216:8;        /*    24:24  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   Cv0ClampValue0EncoderOnly:4; /*    28: 0  4 */
				uint32_t   Cv1ClampValue1EncoderOnly:4; /*    28: 4  4 */
				uint32_t   Cv2ClampValue2EncoderOnly:4; /*    28: 8  4 */
				uint32_t   Cv3ClampValue3EncoderOnly:4; /*    28:12  4 */
				uint32_t   Cv4ClampValue4EncoderOnly:4; /*    28:16  4 */
				uint32_t   Cv5ClampValue5EncoderOnly:4; /*    28:20  4 */
				uint32_t   Cv6ClampValue6EncoderOnly:4; /*    28:24  4 */
				uint32_t   Cv7ClampValue7EncoderOnly:4; /*    28:28  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		void MFC_MPEG2_SLICEGROUP_STATE_CMD(class MFC_MPEG2_SLICEGROUP_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 8;    /*     0     0 */
		static const size_t               byteSize = 32; /*     0     0 */

		/* size: 32, cachelines: 1, members: 8, static members: 2 */
		/* last cacheline: 32 bytes */
	};

	struct MFX_VC1_PRED_PIPE_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:4;         /*     0: 0  4 */
				uint32_t           ReferenceFrameBoundaryReplicationMode:4; /*     0: 4  4 */
				uint32_t           VinIntensitycompSingleBwden:2; /*     0: 8  4 */
				uint32_t           VinIntensitycompSingleFwden:2; /*     0:10  4 */
				uint32_t           VinIntensitycompDoubleBwden:2; /*     0:12  4 */
				uint32_t           VinIntensitycompDoubleFwden:2; /*     0:14  4 */
				uint32_t           Reserved48:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Lumscale1SingleFwd:6; /*     0: 0  4 */
				uint32_t           Reserved70:2;         /*     0: 6  4 */
				uint32_t           Lumscale2SingleFwd:6; /*     0: 8  4 */
				uint32_t           Reserved78:2;         /*     0:14  4 */
				uint32_t           Lumshift1SingleFwd:6; /*     0:16  4 */
				uint32_t           Reserved86:2;         /*     0:22  4 */
				uint32_t           Lumshift2SingleFwd:6; /*     0:24  4 */
				uint32_t           Reserved94:2;         /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Lumscale1DoubleFwd:6; /*     0: 0  4 */
				uint32_t           Reserved102:2;        /*     0: 6  4 */
				uint32_t           Lumscale2DoubleFwd:6; /*     0: 8  4 */
				uint32_t           Reserved110:2;        /*     0:14  4 */
				uint32_t           Lumshift1DoubleFwd:6; /*     0:16  4 */
				uint32_t           Reserved118:2;        /*     0:22  4 */
				uint32_t           Lumshift2DoubleFwd:6; /*     0:24  4 */
				uint32_t           Reserved126:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Lumscale1SingleBwd:6; /*     0: 0  4 */
				uint32_t           Reserved134:2;        /*     0: 6  4 */
				uint32_t           Lumscale2SingleBwd:6; /*     0: 8  4 */
				uint32_t           Reserved142:2;        /*     0:14  4 */
				uint32_t           Lumshift1SingleBwd:6; /*     0:16  4 */
				uint32_t           Reserved150:2;        /*     0:22  4 */
				uint32_t           Lumshift2SingleBwd:6; /*     0:24  4 */
				uint32_t           Reserved158:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Lumscale1DoubleBwd:6; /*     0: 0  4 */
				uint32_t           Reserved166:2;        /*     0: 6  4 */
				uint32_t           Lumscale2DoubleBwd:6; /*     0: 8  4 */
				uint32_t           Reserved174:2;        /*     0:14  4 */
				uint32_t           Lumshift1DoubleBwd:6; /*     0:16  4 */
				uint32_t           Reserved182:2;        /*     0:22  4 */
				uint32_t           Lumshift2DoubleBwd:6; /*     0:24  4 */
				uint32_t           Reserved190:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:4;         /*     4: 0  4 */
				uint32_t   ReferenceFrameBoundaryReplicationMode:4; /*     4: 4  4 */
				uint32_t   VinIntensitycompSingleBwden:2; /*     4: 8  4 */
				uint32_t   VinIntensitycompSingleFwden:2; /*     4:10  4 */
				uint32_t   VinIntensitycompDoubleBwden:2; /*     4:12  4 */
				uint32_t   VinIntensitycompDoubleFwden:2; /*     4:14  4 */
				uint32_t   Reserved48:16;        /*     4:16  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   Lumscale1SingleFwd:6; /*     8: 0  4 */
				uint32_t   Reserved70:2;         /*     8: 6  4 */
				uint32_t   Lumscale2SingleFwd:6; /*     8: 8  4 */
				uint32_t   Reserved78:2;         /*     8:14  4 */
				uint32_t   Lumshift1SingleFwd:6; /*     8:16  4 */
				uint32_t   Reserved86:2;         /*     8:22  4 */
				uint32_t   Lumshift2SingleFwd:6; /*     8:24  4 */
				uint32_t   Reserved94:2;         /*     8:30  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Lumscale1DoubleFwd:6; /*    12: 0  4 */
				uint32_t   Reserved102:2;        /*    12: 6  4 */
				uint32_t   Lumscale2DoubleFwd:6; /*    12: 8  4 */
				uint32_t   Reserved110:2;        /*    12:14  4 */
				uint32_t   Lumshift1DoubleFwd:6; /*    12:16  4 */
				uint32_t   Reserved118:2;        /*    12:22  4 */
				uint32_t   Lumshift2DoubleFwd:6; /*    12:24  4 */
				uint32_t   Reserved126:2;        /*    12:30  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Lumscale1SingleBwd:6; /*    16: 0  4 */
				uint32_t   Reserved134:2;        /*    16: 6  4 */
				uint32_t   Lumscale2SingleBwd:6; /*    16: 8  4 */
				uint32_t   Reserved142:2;        /*    16:14  4 */
				uint32_t   Lumshift1SingleBwd:6; /*    16:16  4 */
				uint32_t   Reserved150:2;        /*    16:22  4 */
				uint32_t   Lumshift2SingleBwd:6; /*    16:24  4 */
				uint32_t   Reserved158:2;        /*    16:30  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   Lumscale1DoubleBwd:6; /*    20: 0  4 */
				uint32_t   Reserved166:2;        /*    20: 6  4 */
				uint32_t   Lumscale2DoubleBwd:6; /*    20: 8  4 */
				uint32_t   Reserved174:2;        /*    20:14  4 */
				uint32_t   Lumshift1DoubleBwd:6; /*    20:16  4 */
				uint32_t   Reserved182:2;        /*    20:22  4 */
				uint32_t   Lumshift2DoubleBwd:6; /*    20:24  4 */
				uint32_t   Reserved190:2;        /*    20:30  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFX_VC1_PRED_PIPE_STATE_CMD(class MFX_VC1_PRED_PIPE_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFD_VC1_LONG_PIC_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Picturewidthinmbsminus1PictureWidthMinus1InMacroblocks:8; /*     0: 0  4 */
				uint32_t           Reserved40:8;         /*     0: 8  4 */
				uint32_t           Pictureheightinmbsminus1PictureHeightMinus1InMacroblocks:8; /*     0:16  4 */
				uint32_t           Reserved56:8;         /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Vc1Profile:1;         /*     0: 0  4 */
				uint32_t           Reserved65:2;         /*     0: 1  4 */
				uint32_t           Secondfield:1;        /*     0: 3  4 */
				uint32_t           OverlapSmoothingEnableFlag:1; /*     0: 4  4 */
				uint32_t           LoopfilterEnableFlag:1; /*     0: 5  4 */
				uint32_t           RangereductionEnable:1; /*     0: 6  4 */
				uint32_t           Rangereductionscale:1; /*     0: 7  4 */
				uint32_t           MotionVectorMode:4;   /*     0: 8  4 */
				uint32_t           Syncmarker:1;         /*     0:12  4 */
				uint32_t           InterpolationRounderContro:1; /*     0:13  4 */
				uint32_t           Implicitquantizer:1;  /*     0:14  4 */
				uint32_t           Dmvsurfacevalid:1;    /*     0:15  4 */
				uint32_t           Reserved80:8;         /*     0:16  4 */
				uint32_t           BitplaneBufferPitchMinus1:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Bscalefactor:8;       /*     0: 0  4 */
				uint32_t           PquantPictureQuantizationValue:5; /*     0: 8  4 */
				uint32_t           Reserved109:3;        /*     0:13  4 */
				uint32_t           AltpquantAlternativePictureQuantizationValue:5; /*     0:16  4 */
				uint32_t           Reserved117:3;        /*     0:21  4 */
				uint32_t           FcmFrameCodingMode:2; /*     0:24  4 */
				uint32_t           PictypePictureType:3; /*     0:26  4 */
				uint32_t           Condover:2;           /*     0:29  4 */
				uint32_t           Reserved127:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Pquantuniform:1;      /*     0: 0  4 */
				uint32_t           Halfqp:1;             /*     0: 1  4 */
				uint32_t           AltpquantconfigAlternativePictureQuantizationConfiguration:2; /*     0: 2  4 */
				uint32_t           AltpquantedgemaskAlternativePictureQuantizationEdgeMask:4; /*     0: 4  4 */
				uint32_t           ExtendedmvrangeExtendedMotionVectorRangeFlag:2; /*     0: 8  4 */
				uint32_t           ExtendeddmvrangeExtendedDifferentialMotionVectorRangeFlag:2; /*     0:10  4 */
				uint32_t           Reserved140:4;        /*     0:12  4 */
				uint32_t           FwdrefdistReferenceDistance:4; /*     0:16  4 */
				uint32_t           BwdrefdistReferenceDistance:4; /*     0:20  4 */
				uint32_t           NumrefNumberOfReferences:1; /*     0:24  4 */
				uint32_t           ReffieldpicpolarityReferenceFieldPicturePolarity:1; /*     0:25  4 */
				uint32_t           FastuvmcflagFastUvMotionCompensationFlag:1; /*     0:26  4 */
				uint32_t           FourmvswitchFourMotionVectorSwitch:1; /*     0:27  4 */
				uint32_t           UnifiedmvmodeUnifiedMotionVectorMode:2; /*     0:28  4 */
				uint32_t           Reserved158:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CbptabCodedBlockPatternTable:3; /*     0: 0  4 */
				uint32_t           TransdctabIntraTransformDcTable:1; /*     0: 3  4 */
				uint32_t           TransacuvPictureLevelTransformChromaAcCodingSetIndexTransactable:2; /*     0: 4  4 */
				uint32_t           TransacyPictureLevelTransformLumaAcCodingSetIndexTransactable2:2; /*     0: 6  4 */
				uint32_t           MbmodetabMacroblockModeTable:3; /*     0: 8  4 */
				uint32_t           TranstypembflagMacroblockTransformTypeFlag:1; /*     0:11  4 */
				uint32_t           TranstypePictureLevelTransformType:2; /*     0:12  4 */
				uint32_t           Reserved174:2;        /*     0:14  4 */
				uint32_t           Twomvbptab2MvBlockPatternTable:2; /*     0:16  4 */
				uint32_t           Fourmvbptab4MvBlockPatternTable:2; /*     0:18  4 */
				uint32_t           MvtabMotionVectorTable:3; /*     0:20  4 */
				uint32_t           Reserved183:1;        /*     0:23  4 */
				uint32_t           Fieldtxraw:1;         /*     0:24  4 */
				uint32_t           Acpredraw:1;          /*     0:25  4 */
				uint32_t           Overflagsraw:1;       /*     0:26  4 */
				uint32_t           Directmbraw:1;        /*     0:27  4 */
				uint32_t           Skipmbraw:1;          /*     0:28  4 */
				uint32_t           Mvtypembraw:1;        /*     0:29  4 */
				uint32_t           Forwardmbraw:1;       /*     0:30  4 */
				uint32_t           BitplanepresentflagBitplaneBufferPresentFlag:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Picturewidthinmbsminus1PictureWidthMinus1InMacroblocks:8; /*     4: 0  4 */
				uint32_t   Reserved40:8;         /*     4: 8  4 */
				uint32_t   Pictureheightinmbsminus1PictureHeightMinus1InMacroblocks:8; /*     4:16  4 */
				uint32_t   Reserved56:8;         /*     4:24  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   Vc1Profile:1;         /*     8: 0  4 */
				uint32_t   Reserved65:2;         /*     8: 1  4 */
				uint32_t   Secondfield:1;        /*     8: 3  4 */
				uint32_t   OverlapSmoothingEnableFlag:1; /*     8: 4  4 */
				uint32_t   LoopfilterEnableFlag:1; /*     8: 5  4 */
				uint32_t   RangereductionEnable:1; /*     8: 6  4 */
				uint32_t   Rangereductionscale:1; /*     8: 7  4 */
				uint32_t   MotionVectorMode:4;   /*     8: 8  4 */
				uint32_t   Syncmarker:1;         /*     8:12  4 */
				uint32_t   InterpolationRounderContro:1; /*     8:13  4 */
				uint32_t   Implicitquantizer:1;  /*     8:14  4 */
				uint32_t   Dmvsurfacevalid:1;    /*     8:15  4 */
				uint32_t   Reserved80:8;         /*     8:16  4 */
				uint32_t   BitplaneBufferPitchMinus1:8; /*     8:24  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   Bscalefactor:8;       /*    12: 0  4 */
				uint32_t   PquantPictureQuantizationValue:5; /*    12: 8  4 */
				uint32_t   Reserved109:3;        /*    12:13  4 */
				uint32_t   AltpquantAlternativePictureQuantizationValue:5; /*    12:16  4 */
				uint32_t   Reserved117:3;        /*    12:21  4 */
				uint32_t   FcmFrameCodingMode:2; /*    12:24  4 */
				uint32_t   PictypePictureType:3; /*    12:26  4 */
				uint32_t   Condover:2;           /*    12:29  4 */
				uint32_t   Reserved127:1;        /*    12:31  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Pquantuniform:1;      /*    16: 0  4 */
				uint32_t   Halfqp:1;             /*    16: 1  4 */
				uint32_t   AltpquantconfigAlternativePictureQuantizationConfiguration:2; /*    16: 2  4 */
				uint32_t   AltpquantedgemaskAlternativePictureQuantizationEdgeMask:4; /*    16: 4  4 */
				uint32_t   ExtendedmvrangeExtendedMotionVectorRangeFlag:2; /*    16: 8  4 */
				uint32_t   ExtendeddmvrangeExtendedDifferentialMotionVectorRangeFlag:2; /*    16:10  4 */
				uint32_t   Reserved140:4;        /*    16:12  4 */
				uint32_t   FwdrefdistReferenceDistance:4; /*    16:16  4 */
				uint32_t   BwdrefdistReferenceDistance:4; /*    16:20  4 */
				uint32_t   NumrefNumberOfReferences:1; /*    16:24  4 */
				uint32_t   ReffieldpicpolarityReferenceFieldPicturePolarity:1; /*    16:25  4 */
				uint32_t   FastuvmcflagFastUvMotionCompensationFlag:1; /*    16:26  4 */
				uint32_t   FourmvswitchFourMotionVectorSwitch:1; /*    16:27  4 */
				uint32_t   UnifiedmvmodeUnifiedMotionVectorMode:2; /*    16:28  4 */
				uint32_t   Reserved158:2;        /*    16:30  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   CbptabCodedBlockPatternTable:3; /*    20: 0  4 */
				uint32_t   TransdctabIntraTransformDcTable:1; /*    20: 3  4 */
				uint32_t   TransacuvPictureLevelTransformChromaAcCodingSetIndexTransactable:2; /*    20: 4  4 */
				uint32_t   TransacyPictureLevelTransformLumaAcCodingSetIndexTransactable2:2; /*    20: 6  4 */
				uint32_t   MbmodetabMacroblockModeTable:3; /*    20: 8  4 */
				uint32_t   TranstypembflagMacroblockTransformTypeFlag:1; /*    20:11  4 */
				uint32_t   TranstypePictureLevelTransformType:2; /*    20:12  4 */
				uint32_t   Reserved174:2;        /*    20:14  4 */
				uint32_t   Twomvbptab2MvBlockPatternTable:2; /*    20:16  4 */
				uint32_t   Fourmvbptab4MvBlockPatternTable:2; /*    20:18  4 */
				uint32_t   MvtabMotionVectorTable:3; /*    20:20  4 */
				uint32_t   Reserved183:1;        /*    20:23  4 */
				uint32_t   Fieldtxraw:1;         /*    20:24  4 */
				uint32_t   Acpredraw:1;          /*    20:25  4 */
				uint32_t   Overflagsraw:1;       /*    20:26  4 */
				uint32_t   Directmbraw:1;        /*    20:27  4 */
				uint32_t   Skipmbraw:1;          /*    20:28  4 */
				uint32_t   Mvtypembraw:1;        /*    20:29  4 */
				uint32_t   Forwardmbraw:1;       /*    20:30  4 */
				uint32_t   BitplanepresentflagBitplaneBufferPresentFlag:1; /*    20:31  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFD_VC1_LONG_PIC_STATE_CMD(class MFD_VC1_LONG_PIC_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFD_VC1_SHORT_PIC_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PictureWidth:8;       /*     0: 0  4 */
				uint32_t           Reserved40:8;         /*     0: 8  4 */
				uint32_t           PictureHeight:8;      /*     0:16  4 */
				uint32_t           Reserved56:8;         /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PictureStructure:2;   /*     0: 0  4 */
				uint32_t           Reserved66:1;         /*     0: 2  4 */
				uint32_t           Secondfield:1;        /*     0: 3  4 */
				uint32_t           IntraPictureFlag:1;   /*     0: 4  4 */
				uint32_t           BackwardPredictionPresentFlag:1; /*     0: 5  4 */
				uint32_t           Reserved70:5;         /*     0: 6  4 */
				uint32_t           Vc1Profile:1;         /*     0:11  4 */
				uint32_t           Reserved76:3;         /*     0:12  4 */
				uint32_t           Dmvsurfacevalid:1;    /*     0:15  4 */
				uint32_t           MotionVectorMode:4;   /*     0:16  4 */
				uint32_t           Reserved84:3;         /*     0:20  4 */
				uint32_t           InterpolationRounderControl:1; /*     0:23  4 */
				uint32_t           BitplaneBufferPitchMinus1:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           VstransformFlag:1;    /*     0: 0  4 */
				uint32_t           Dquant:2;             /*     0: 1  4 */
				uint32_t           ExtendedMvPresentFlag:1; /*     0: 3  4 */
				uint32_t           FastuvmcflagFastUvMotionCompensationFlag:1; /*     0: 4  4 */
				uint32_t           LoopfilterEnableFlag:1; /*     0: 5  4 */
				uint32_t           RefdistFlag:1;        /*     0: 6  4 */
				uint32_t           PanscanPresentFlag:1; /*     0: 7  4 */
				uint32_t           Maxbframes:3;         /*     0: 8  4 */
				uint32_t           RangeredPresentFlagForSimpleMainProfileOnly:1; /*     0:11  4 */
				uint32_t           SyncmarkerPresentFlagForSimpleMainProfileOnly:1; /*     0:12  4 */
				uint32_t           MultiresPresentFlagForSimpleMainProfileOnly:1; /*     0:13  4 */
				uint32_t           Quantizer:2;          /*     0:14  4 */
				uint32_t           PPicRefDistance:5;    /*     0:16  4 */
				uint32_t           Reserved117:1;        /*     0:21  4 */
				uint32_t           ProgressivePicType:2; /*     0:22  4 */
				uint32_t           Reserved120:4;        /*     0:24  4 */
				uint32_t           RangeReductionEnable:1; /*     0:28  4 */
				uint32_t           RangeReductionScale:1; /*     0:29  4 */
				uint32_t           OverlapSmoothingEnableFlag:1; /*     0:30  4 */
				uint32_t           Reserved127:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           ExtendedDmvPresentFlag:1; /*     0: 0  4 */
				uint32_t           Psf:1;                /*     0: 1  4 */
				uint32_t           RefpicFlag:1;         /*     0: 2  4 */
				uint32_t           Finterflag:1;         /*     0: 3  4 */
				uint32_t           Tfcntrflag:1;         /*     0: 4  4 */
				uint32_t           Interlace:1;          /*     0: 5  4 */
				uint32_t           Pulldown:1;           /*     0: 6  4 */
				uint32_t           PostprocFlag:1;       /*     0: 7  4 */
				uint32_t           _4MvAllowedFlag:1;    /*     0: 8  4 */
				uint32_t           Reserved137:15;       /*     0: 9  4 */
				uint32_t           BfractionEnumeration:5; /*     0:24  4 */
				uint32_t           Reserved157:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   PictureWidth:8;       /*     4: 0  4 */
				uint32_t   Reserved40:8;         /*     4: 8  4 */
				uint32_t   PictureHeight:8;      /*     4:16  4 */
				uint32_t   Reserved56:8;         /*     4:24  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   PictureStructure:2;   /*     8: 0  4 */
				uint32_t   Reserved66:1;         /*     8: 2  4 */
				uint32_t   Secondfield:1;        /*     8: 3  4 */
				uint32_t   IntraPictureFlag:1;   /*     8: 4  4 */
				uint32_t   BackwardPredictionPresentFlag:1; /*     8: 5  4 */
				uint32_t   Reserved70:5;         /*     8: 6  4 */
				uint32_t   Vc1Profile:1;         /*     8:11  4 */
				uint32_t   Reserved76:3;         /*     8:12  4 */
				uint32_t   Dmvsurfacevalid:1;    /*     8:15  4 */
				uint32_t   MotionVectorMode:4;   /*     8:16  4 */
				uint32_t   Reserved84:3;         /*     8:20  4 */
				uint32_t   InterpolationRounderControl:1; /*     8:23  4 */
				uint32_t   BitplaneBufferPitchMinus1:8; /*     8:24  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   VstransformFlag:1;    /*    12: 0  4 */
				uint32_t   Dquant:2;             /*    12: 1  4 */
				uint32_t   ExtendedMvPresentFlag:1; /*    12: 3  4 */
				uint32_t   FastuvmcflagFastUvMotionCompensationFlag:1; /*    12: 4  4 */
				uint32_t   LoopfilterEnableFlag:1; /*    12: 5  4 */
				uint32_t   RefdistFlag:1;        /*    12: 6  4 */
				uint32_t   PanscanPresentFlag:1; /*    12: 7  4 */
				uint32_t   Maxbframes:3;         /*    12: 8  4 */
				uint32_t   RangeredPresentFlagForSimpleMainProfileOnly:1; /*    12:11  4 */
				uint32_t   SyncmarkerPresentFlagForSimpleMainProfileOnly:1; /*    12:12  4 */
				uint32_t   MultiresPresentFlagForSimpleMainProfileOnly:1; /*    12:13  4 */
				uint32_t   Quantizer:2;          /*    12:14  4 */
				uint32_t   PPicRefDistance:5;    /*    12:16  4 */
				uint32_t   Reserved117:1;        /*    12:21  4 */
				uint32_t   ProgressivePicType:2; /*    12:22  4 */
				uint32_t   Reserved120:4;        /*    12:24  4 */
				uint32_t   RangeReductionEnable:1; /*    12:28  4 */
				uint32_t   RangeReductionScale:1; /*    12:29  4 */
				uint32_t   OverlapSmoothingEnableFlag:1; /*    12:30  4 */
				uint32_t   Reserved127:1;        /*    12:31  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   ExtendedDmvPresentFlag:1; /*    16: 0  4 */
				uint32_t   Psf:1;                /*    16: 1  4 */
				uint32_t   RefpicFlag:1;         /*    16: 2  4 */
				uint32_t   Finterflag:1;         /*    16: 3  4 */
				uint32_t   Tfcntrflag:1;         /*    16: 4  4 */
				uint32_t   Interlace:1;          /*    16: 5  4 */
				uint32_t   Pulldown:1;           /*    16: 6  4 */
				uint32_t   PostprocFlag:1;       /*    16: 7  4 */
				uint32_t   _4MvAllowedFlag:1;    /*    16: 8  4 */
				uint32_t   Reserved137:15;       /*    16: 9  4 */
				uint32_t   BfractionEnumeration:5; /*    16:24  4 */
				uint32_t   Reserved157:3;        /*    16:29  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		void MFD_VC1_SHORT_PIC_STATE_CMD(class MFD_VC1_SHORT_PIC_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 5;    /*     0     0 */
		static const size_t               byteSize = 20; /*     0     0 */

		/* size: 20, cachelines: 1, members: 5, static members: 2 */
		/* last cacheline: 20 bytes */
	};

	struct MFX_VC1_DIRECTMODE_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:6;         /*     0: 0  4 */
				uint32_t           DirectMvWriteBufferBaseAddressForTheCurrentPicture:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           DirectMvWriteBufferBaseAddressForTheCurrentPicture4732:16; /*     0: 0  4 */
				uint32_t           Reserved80:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           DirectMvWriteBufferBaseAddressForTheCurrentPictureArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           DirectMvWriteBufferMemoryCompressionEnable:1; /*     0: 9  4 */
				uint32_t           DirectMvWriteBufferMemoryCompressionMode:1; /*     0:10  4 */
				uint32_t           Reserved107:2;        /*     0:11  4 */
				uint32_t           DirectMvWriteBufferTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved111:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128:6;        /*     0: 0  4 */
				uint32_t           DirectMvReadBufferBaseAddressForTheReferencePicture:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           DirectMvReadBufferBaseAddressForTheCurrentPicture4732:16; /*     0: 0  4 */
				uint32_t           Reserved176:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MemoryObjectControlState:7; /*     0: 0  4 */
				uint32_t           DirectMvReadBufferBaseAddressForTheCurrentPictureArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           DirectMvReadBufferMemoryCompressionEnable:1; /*     0: 9  4 */
				uint32_t           DirectMvReadBufferMemoryCompressionMode:1; /*     0:10  4 */
				uint32_t           Reserved203:2;        /*     0:11  4 */
				uint32_t           DirectMvReadBufferTiledResourceMode:2; /*     0:13  4 */
				uint32_t           Reserved207:17;       /*     0:15  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:6;         /*     4: 0  4 */
				uint32_t   DirectMvWriteBufferBaseAddressForTheCurrentPicture:26; /*     4: 6  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   DirectMvWriteBufferBaseAddressForTheCurrentPicture4732:16; /*     8: 0  4 */
				uint32_t   Reserved80:16;        /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    12: 0  4 */
				uint32_t   DirectMvWriteBufferBaseAddressForTheCurrentPictureArbitrationPriorityControl:2; /*    12: 7  4 */
				uint32_t   DirectMvWriteBufferMemoryCompressionEnable:1; /*    12: 9  4 */
				uint32_t   DirectMvWriteBufferMemoryCompressionMode:1; /*    12:10  4 */
				uint32_t   Reserved107:2;        /*    12:11  4 */
				uint32_t   DirectMvWriteBufferTiledResourceMode:2; /*    12:13  4 */
				uint32_t   Reserved111:17;       /*    12:15  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128:6;        /*    16: 0  4 */
				uint32_t   DirectMvReadBufferBaseAddressForTheReferencePicture:26; /*    16: 6  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   DirectMvReadBufferBaseAddressForTheCurrentPicture4732:16; /*    20: 0  4 */
				uint32_t   Reserved176:16;       /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   MemoryObjectControlState:7; /*    24: 0  4 */
				uint32_t   DirectMvReadBufferBaseAddressForTheCurrentPictureArbitrationPriorityControl:2; /*    24: 7  4 */
				uint32_t   DirectMvReadBufferMemoryCompressionEnable:1; /*    24: 9  4 */
				uint32_t   DirectMvReadBufferMemoryCompressionMode:1; /*    24:10  4 */
				uint32_t   Reserved203:2;        /*    24:11  4 */
				uint32_t   DirectMvReadBufferTiledResourceMode:2; /*    24:13  4 */
				uint32_t   Reserved207:17;       /*    24:15  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		void MFX_VC1_DIRECTMODE_STATE_CMD(class MFX_VC1_DIRECTMODE_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 7;    /*     0     0 */
		static const size_t               byteSize = 28; /*     0     0 */

		/* size: 28, cachelines: 1, members: 7, static members: 2 */
		/* last cacheline: 28 bytes */
	};

	struct MFD_VC1_BSD_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectBsdDataLength:24; /*     0: 0  4 */
				uint32_t           Reserved56:8;         /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectDataStartAddress:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           NextSliceVerticalPosition:9; /*     0: 0  4 */
				uint32_t           Reserved105:7;        /*     0: 9  4 */
				uint32_t           SliceStartVerticalPosition:8; /*     0:16  4 */
				uint32_t           Reserved120:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FirstmbbitoffsetFirstMacroblockBitOffset:3; /*     0: 0  4 */
				uint32_t           Reserved131:1;        /*     0: 3  4 */
				uint32_t           EmulationPreventionBytePresent:1; /*     0: 4  4 */
				uint32_t           Reserved133:11;       /*     0: 5  4 */
				uint32_t           FirstMbByteOffsetOfSliceDataOrSliceHeader:16; /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectBsdDataLength:24; /*     4: 0  4 */
				uint32_t   Reserved56:8;         /*     4:24  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectDataStartAddress:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   NextSliceVerticalPosition:9; /*    12: 0  4 */
				uint32_t   Reserved105:7;        /*    12: 9  4 */
				uint32_t   SliceStartVerticalPosition:8; /*    12:16  4 */
				uint32_t   Reserved120:8;        /*    12:24  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   FirstmbbitoffsetFirstMacroblockBitOffset:3; /*    16: 0  4 */
				uint32_t   Reserved131:1;        /*    16: 3  4 */
				uint32_t   EmulationPreventionBytePresent:1; /*    16: 4  4 */
				uint32_t   Reserved133:11;       /*    16: 5  4 */
				uint32_t   FirstMbByteOffsetOfSliceDataOrSliceHeader:16; /*    16:16  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		void MFD_VC1_BSD_OBJECT_CMD(class MFD_VC1_BSD_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 5;    /*     0     0 */
		static const size_t               byteSize = 20; /*     0     0 */

		/* size: 20, cachelines: 1, members: 5, static members: 2 */
		/* last cacheline: 20 bytes */
	};

	struct MFX_JPEG_PIC_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           OutputMcuStructure:3; /*     0: 0  4 */
				uint32_t           Reserved35:5;         /*     0: 3  4 */
				uint32_t           InputSurfaceFormatYuv:4; /*     0: 8  4 */
				uint32_t           Reserved44:9;         /*     0:12  4 */
				uint32_t           PixelsInVerticalLastMcu:5; /*     0:21  4 */
				uint32_t           PixelsInHorizontalLastMcu:5; /*     0:26  4 */
				uint32_t           Reserved63:1;         /*     0:31  4 */
			} Obj0;                                          /*     0     4 */
			struct {
				uint32_t           InputFormatYuv:3;     /*     0: 0  4 */
				uint32_t           Reserved35:1;         /*     0: 3  4 */
				uint32_t           Rotation:2;           /*     0: 4  4 */
				uint32_t           Reserved38:2;         /*     0: 6  4 */
				uint32_t           OutputFormatYuv:4;    /*     0: 8  4 */
				uint32_t           Reserved44:4;         /*     0:12  4 */
				uint32_t           AverageDownSampling:1; /*     0:16  4 */
				uint32_t           VerticalDownSamplingEnable:1; /*     0:17  4 */
				uint32_t           HorizontalDownSamplingEnable:1; /*     0:18  4 */
				uint32_t           Reserved51:1;         /*     0:19  4 */
				uint32_t           VerticalUpSamplingEnable:1; /*     0:20  4 */
				uint32_t           Reserved53:11;        /*     0:21  4 */
			} Obj1;                                          /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameWidthInBlocksMinus1:13; /*     0: 0  4 */
				uint32_t           Reserved77:3;         /*     0:13  4 */
				uint32_t           FrameHeightInBlocksMinus1:13; /*     0:16  4 */
				uint32_t           OutputPixelNormalize:1; /*     0:29  4 */
				uint32_t           Reserved94:2;         /*     0:30  4 */
			} Obj0;                                          /*     0     4 */
			struct {
				uint32_t           FrameWidthInBlksMinus1:13; /*     0: 0  4 */
				uint32_t           Roundingquant:3;      /*     0:13  4 */
				uint32_t           FrameHeightInBlksMinus1:13; /*     0:16  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			} Obj1;                                          /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   OutputMcuStructure:3; /*     4: 0  4 */
				uint32_t   Reserved35:5;         /*     4: 3  4 */
				uint32_t   InputSurfaceFormatYuv:4; /*     4: 8  4 */
				uint32_t   Reserved44:9;         /*     4:12  4 */
				uint32_t   PixelsInVerticalLastMcu:5; /*     4:21  4 */
				uint32_t   PixelsInHorizontalLastMcu:5; /*     4:26  4 */
				uint32_t   Reserved63:1;         /*     4:31  4 */
			} Obj0;                                  /*     4     4 */
			struct {
				uint32_t   InputFormatYuv:3;     /*     4: 0  4 */
				uint32_t   Reserved35:1;         /*     4: 3  4 */
				uint32_t   Rotation:2;           /*     4: 4  4 */
				uint32_t   Reserved38:2;         /*     4: 6  4 */
				uint32_t   OutputFormatYuv:4;    /*     4: 8  4 */
				uint32_t   Reserved44:4;         /*     4:12  4 */
				uint32_t   AverageDownSampling:1; /*     4:16  4 */
				uint32_t   VerticalDownSamplingEnable:1; /*     4:17  4 */
				uint32_t   HorizontalDownSamplingEnable:1; /*     4:18  4 */
				uint32_t   Reserved51:1;         /*     4:19  4 */
				uint32_t   VerticalUpSamplingEnable:1; /*     4:20  4 */
				uint32_t   Reserved53:11;        /*     4:21  4 */
			} Obj1;                                  /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   FrameWidthInBlocksMinus1:13; /*     8: 0  4 */
				uint32_t   Reserved77:3;         /*     8:13  4 */
				uint32_t   FrameHeightInBlocksMinus1:13; /*     8:16  4 */
				uint32_t   OutputPixelNormalize:1; /*     8:29  4 */
				uint32_t   Reserved94:2;         /*     8:30  4 */
			} Obj0;                                  /*     8     4 */
			struct {
				uint32_t   FrameWidthInBlksMinus1:13; /*     8: 0  4 */
				uint32_t   Roundingquant:3;      /*     8:13  4 */
				uint32_t   FrameHeightInBlksMinus1:13; /*     8:16  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			} Obj1;                                  /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		void MFX_JPEG_PIC_STATE_CMD(class MFX_JPEG_PIC_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 3;    /*     0     0 */
		static const size_t               byteSize = 12; /*     0     0 */

		/* size: 12, cachelines: 1, members: 3, static members: 2 */
		/* last cacheline: 12 bytes */
	};

	struct MFC_JPEG_HUFF_TABLE_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           HuffTableId:1;        /*     0: 0  4 */
				uint32_t           Reserved33:31;        /*     0: 1  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   HuffTableId:1;        /*     4: 0  4 */
				uint32_t   Reserved33:31;        /*     4: 1  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		uint32_t                   DcTable[12];          /*     8    48 */
		uint32_t                   AcTable[162];         /*    56   648 */
		void MFC_JPEG_HUFF_TABLE_STATE_CMD(class MFC_JPEG_HUFF_TABLE_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 176;  /*     0     0 */
		static const size_t               byteSize = 704; /*     0     0 */

		/* size: 704, cachelines: 11, members: 4, static members: 2 */
	};

	struct MFD_JPEG_BSD_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectDataLength;   /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectDataStartAddress:29; /*     0: 0  4 */
				uint32_t           Reserved93:3;         /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           ScanVerticalPosition:13; /*     0: 0  4 */
				uint32_t           Reserved109:3;        /*     0:13  4 */
				uint32_t           ScanHorizontalPosition:13; /*     0:16  4 */
				uint32_t           Reserved125:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           McuCount:26;          /*     0: 0  4 */
				uint32_t           Reserved154:1;        /*     0:26  4 */
				uint32_t           ScanComponents:3;     /*     0:27  4 */
				uint32_t           Interleaved:1;        /*     0:30  4 */
				uint32_t           Reserved159:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Restartinterval16Bit:16; /*     0: 0  4 */
				uint32_t           Reserved176:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   IndirectDataLength;   /*     4     4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   IndirectDataStartAddress:29; /*     8: 0  4 */
				uint32_t   Reserved93:3;         /*     8:29  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   ScanVerticalPosition:13; /*    12: 0  4 */
				uint32_t   Reserved109:3;        /*    12:13  4 */
				uint32_t   ScanHorizontalPosition:13; /*    12:16  4 */
				uint32_t   Reserved125:3;        /*    12:29  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   McuCount:26;          /*    16: 0  4 */
				uint32_t   Reserved154:1;        /*    16:26  4 */
				uint32_t   ScanComponents:3;     /*    16:27  4 */
				uint32_t   Interleaved:1;        /*    16:30  4 */
				uint32_t   Reserved159:1;        /*    16:31  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   Restartinterval16Bit:16; /*    20: 0  4 */
				uint32_t   Reserved176:16;       /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		void MFD_JPEG_BSD_OBJECT_CMD(class MFD_JPEG_BSD_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 6;    /*     0     0 */
		static const size_t               byteSize = 24; /*     0     0 */

		/* size: 24, cachelines: 1, members: 6, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFC_JPEG_SCAN_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubopcodeB:5;         /*     0:16  4 */
				uint32_t           SubopcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           McuCount:26;          /*     0: 0  4 */
				uint32_t           Reserved58:6;         /*     0:26  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           RestartInterval:16;   /*     0: 0  4 */
				uint32_t           IsLastScan:1;         /*     0:16  4 */
				uint32_t           HeadPresentFlag:1;    /*     0:17  4 */
				uint32_t           HuffmanDcTable:3;     /*     0:18  4 */
				uint32_t           Reserved85:1;         /*     0:21  4 */
				uint32_t           HuffmanAcTable:3;     /*     0:22  4 */
				uint32_t           Reserved89:7;         /*     0:25  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubopcodeB:5;         /*     0:16  4 */
				uint32_t   SubopcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   McuCount:26;          /*     4: 0  4 */
				uint32_t   Reserved58:6;         /*     4:26  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   RestartInterval:16;   /*     8: 0  4 */
				uint32_t   IsLastScan:1;         /*     8:16  4 */
				uint32_t   HeadPresentFlag:1;    /*     8:17  4 */
				uint32_t   HuffmanDcTable:3;     /*     8:18  4 */
				uint32_t   Reserved85:1;         /*     8:21  4 */
				uint32_t   HuffmanAcTable:3;     /*     8:22  4 */
				uint32_t   Reserved89:7;         /*     8:25  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		void MFC_JPEG_SCAN_OBJECT_CMD(class MFC_JPEG_SCAN_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 3;    /*     0     0 */
		static const size_t               byteSize = 12; /*     0     0 */

		/* size: 12, cachelines: 1, members: 3, static members: 2 */
		/* last cacheline: 12 bytes */
	};

	struct MFX_VP8_Encoder_CFG_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubOpcodeB:5;         /*     0:16  4 */
				uint32_t           SubOpcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerformanceCounterEnable:1; /*     0: 0  4 */
				uint32_t           FinalBitstreamOutputDisable:1; /*     0: 1  4 */
				uint32_t           TokenStatisticsOutputEnable:1; /*     0: 2  4 */
				uint32_t           BitstreamStatisticsOutputEnable:1; /*     0: 3  4 */
				uint32_t           UpdateSegmentFeatureDataFlag:1; /*     0: 4  4 */
				uint32_t           SkipFinalBitstreamWhenOverUnderFlow:1; /*     0: 5  4 */
				uint32_t           RateControlInitialPass:1; /*     0: 6  4 */
				uint32_t           PerSegmentDeltaQindexLoopfilterDisable:1; /*     0: 7  4 */
				uint32_t           FinerBrcEnable:1;     /*     0: 8  4 */
				uint32_t           CompressedBitstreamOutputDisable:1; /*     0: 9  4 */
				uint32_t           VbspunitpowerclockGatingDisable:1; /*     0:10  4 */
				uint32_t           Reserved43:21;        /*     0:11  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MaxFrameBitCountRateControlEnableMask:1; /*     0: 0  4 */
				uint32_t           MinFrameBitCountRateControlEnableMask:1; /*     0: 1  4 */
				uint32_t           MaxInterMbBitCountCheckEnableMask:1; /*     0: 2  4 */
				uint32_t           MaxIntraMbBitCountCheckEnableMask:1; /*     0: 3  4 */
				uint32_t           IntermediateBitBufferOverrunEnableMask:1; /*     0: 4  4 */
				uint32_t           FinalBistreamBufferOverrunEnableMask:1; /*     0: 5  4 */
				uint32_t           QindexClampHighMaskForUnderflow:1; /*     0: 6  4 */
				uint32_t           QindexClampHighMaskForOverflow:1; /*     0: 7  4 */
				uint32_t           Reserved72:24;        /*     0: 8  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MaxInterMbBitCount:12; /*     0: 0  4 */
				uint32_t           Reserved108:4;        /*     0:12  4 */
				uint32_t           MaxIntraMbBitCountLimit:12; /*     0:16  4 */
				uint32_t           Reserved124:4;        /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameBitRateMax:14;   /*     0: 0  4 */
				uint32_t           FrameBitRateMaxUnit:1; /*     0:14  4 */
				uint32_t           FrameBitrateMaxUnitMode:1; /*     0:15  4 */
				uint32_t           FrameBitRateMin:14;   /*     0:16  4 */
				uint32_t           FrameBitRateMinUnit:1; /*     0:30  4 */
				uint32_t           FrameBitrateMinUnitMode:1; /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameDeltaQindexMax0:8; /*     0: 0  4 */
				uint32_t           FrameDeltaQindexMax1:8; /*     0: 8  4 */
				uint32_t           FrameDeltaqIndexMax2:8; /*     0:16  4 */
				uint32_t           FrameDeltaQindexMax3:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameDeltaQindexMin0:8; /*     0: 0  4 */
				uint32_t           FrameDeltaQindexMin1:8; /*     0: 8  4 */
				uint32_t           FrameDeltaQindexMin2:8; /*     0:16  4 */
				uint32_t           FrameDeltaQindexMin3:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMax1; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMin1; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMax2; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMin2; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMax3; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaQindexMin3; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameDeltaLoopFilterMax0:8; /*     0: 0  4 */
				uint32_t           FramEdeltaLoopFilterMax1:8; /*     0: 8  4 */
				uint32_t           FrameDeltaLoopFilterMax2:8; /*     0:16  4 */
				uint32_t           FrameDeltaLoopFilterMax3:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameDeltaLoopFilterMin0:8; /*     0: 0  4 */
				uint32_t           FrameDeltaLoopFilterMin1:8; /*     0: 8  4 */
				uint32_t           FrameDeltaLoopFilterMin2:8; /*     0:16  4 */
				uint32_t           FrameDeltaLoopFilterMin3:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMax1; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMin1; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMax2; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMin2; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMax3; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           PerSegmentFrameDeltaLoopfilterMin3; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameBitRateMaxDelta:15; /*     0: 0  4 */
				uint32_t           Reserved687:1;        /*     0:15  4 */
				uint32_t           Framebitratemindelta:15; /*     0:16  4 */
				uint32_t           Reserved703:1;        /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           MinFrameWsize:16;     /*     0: 0  4 */
				uint32_t           MinFrameWsizeUnit:2;  /*     0:16  4 */
				uint32_t           Reserved722:2;        /*     0:18  4 */
				uint32_t           BitstreamFormatVersion:3; /*     0:20  4 */
				uint32_t           ShowFrame:1;          /*     0:23  4 */
				uint32_t           Reserved728:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           HorizontalSizeCode:16; /*     0: 0  4 */
				uint32_t           VerticalSizeCode:16;  /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBitCount;  /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBinBufferQindexUpdatePointer; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBinBufferLoopfilterUpdatePointer; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBinBufferTokenUpdatePointer; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBinBufferMvupdatePointer; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Cv0ClampValue0:4;     /*     0: 0  4 */
				uint32_t           Cv1:4;                /*     0: 4  4 */
				uint32_t           Cv2:4;                /*     0: 8  4 */
				uint32_t           Cv3:4;                /*     0:12  4 */
				uint32_t           Cv4:4;                /*     0:16  4 */
				uint32_t           Cv5:4;                /*     0:20  4 */
				uint32_t           Cv6:4;                /*     0:24  4 */
				uint32_t           ClampvaluesCv7:4;     /*     0:28  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubOpcodeB:5;         /*     0:16  4 */
				uint32_t   SubOpcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   PerformanceCounterEnable:1; /*     4: 0  4 */
				uint32_t   FinalBitstreamOutputDisable:1; /*     4: 1  4 */
				uint32_t   TokenStatisticsOutputEnable:1; /*     4: 2  4 */
				uint32_t   BitstreamStatisticsOutputEnable:1; /*     4: 3  4 */
				uint32_t   UpdateSegmentFeatureDataFlag:1; /*     4: 4  4 */
				uint32_t   SkipFinalBitstreamWhenOverUnderFlow:1; /*     4: 5  4 */
				uint32_t   RateControlInitialPass:1; /*     4: 6  4 */
				uint32_t   PerSegmentDeltaQindexLoopfilterDisable:1; /*     4: 7  4 */
				uint32_t   FinerBrcEnable:1;     /*     4: 8  4 */
				uint32_t   CompressedBitstreamOutputDisable:1; /*     4: 9  4 */
				uint32_t   VbspunitpowerclockGatingDisable:1; /*     4:10  4 */
				uint32_t   Reserved43:21;        /*     4:11  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   MaxFrameBitCountRateControlEnableMask:1; /*     8: 0  4 */
				uint32_t   MinFrameBitCountRateControlEnableMask:1; /*     8: 1  4 */
				uint32_t   MaxInterMbBitCountCheckEnableMask:1; /*     8: 2  4 */
				uint32_t   MaxIntraMbBitCountCheckEnableMask:1; /*     8: 3  4 */
				uint32_t   IntermediateBitBufferOverrunEnableMask:1; /*     8: 4  4 */
				uint32_t   FinalBistreamBufferOverrunEnableMask:1; /*     8: 5  4 */
				uint32_t   QindexClampHighMaskForUnderflow:1; /*     8: 6  4 */
				uint32_t   QindexClampHighMaskForOverflow:1; /*     8: 7  4 */
				uint32_t   Reserved72:24;        /*     8: 8  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   MaxInterMbBitCount:12; /*    12: 0  4 */
				uint32_t   Reserved108:4;        /*    12:12  4 */
				uint32_t   MaxIntraMbBitCountLimit:12; /*    12:16  4 */
				uint32_t   Reserved124:4;        /*    12:28  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   FrameBitRateMax:14;   /*    16: 0  4 */
				uint32_t   FrameBitRateMaxUnit:1; /*    16:14  4 */
				uint32_t   FrameBitrateMaxUnitMode:1; /*    16:15  4 */
				uint32_t   FrameBitRateMin:14;   /*    16:16  4 */
				uint32_t   FrameBitRateMinUnit:1; /*    16:30  4 */
				uint32_t   FrameBitrateMinUnitMode:1; /*    16:31  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   FrameDeltaQindexMax0:8; /*    20: 0  4 */
				uint32_t   FrameDeltaQindexMax1:8; /*    20: 8  4 */
				uint32_t   FrameDeltaqIndexMax2:8; /*    20:16  4 */
				uint32_t   FrameDeltaQindexMax3:8; /*    20:24  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   FrameDeltaQindexMin0:8; /*    24: 0  4 */
				uint32_t   FrameDeltaQindexMin1:8; /*    24: 8  4 */
				uint32_t   FrameDeltaQindexMin2:8; /*    24:16  4 */
				uint32_t   FrameDeltaQindexMin3:8; /*    24:24  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMax1; /*    28     4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMin1; /*    32     4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMax2; /*    36     4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMin2; /*    40     4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMax3; /*    44     4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaQindexMin3; /*    48     4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		union {
			struct {
				uint32_t   FrameDeltaLoopFilterMax0:8; /*    52: 0  4 */
				uint32_t   FramEdeltaLoopFilterMax1:8; /*    52: 8  4 */
				uint32_t   FrameDeltaLoopFilterMax2:8; /*    52:16  4 */
				uint32_t   FrameDeltaLoopFilterMax3:8; /*    52:24  4 */
			};                                       /*    52     4 */
			uint32_t           Value;                /*    52     4 */
		} DW13;                                          /*    52     4 */
		union {
			struct {
				uint32_t   FrameDeltaLoopFilterMin0:8; /*    56: 0  4 */
				uint32_t   FrameDeltaLoopFilterMin1:8; /*    56: 8  4 */
				uint32_t   FrameDeltaLoopFilterMin2:8; /*    56:16  4 */
				uint32_t   FrameDeltaLoopFilterMin3:8; /*    56:24  4 */
			};                                       /*    56     4 */
			uint32_t           Value;                /*    56     4 */
		} DW14;                                          /*    56     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMax1; /*    60     4 */
			};                                       /*    60     4 */
			uint32_t           Value;                /*    60     4 */
		} DW15;                                          /*    60     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMin1; /*    64     4 */
			};                                       /*    64     4 */
			uint32_t           Value;                /*    64     4 */
		} DW16;                                          /*    64     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMax2; /*    68     4 */
			};                                       /*    68     4 */
			uint32_t           Value;                /*    68     4 */
		} DW17;                                          /*    68     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMin2; /*    72     4 */
			};                                       /*    72     4 */
			uint32_t           Value;                /*    72     4 */
		} DW18;                                          /*    72     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMax3; /*    76     4 */
			};                                       /*    76     4 */
			uint32_t           Value;                /*    76     4 */
		} DW19;                                          /*    76     4 */
		union {
			struct {
				uint32_t   PerSegmentFrameDeltaLoopfilterMin3; /*    80     4 */
			};                                       /*    80     4 */
			uint32_t           Value;                /*    80     4 */
		} DW20;                                          /*    80     4 */
		union {
			struct {
				uint32_t   FrameBitRateMaxDelta:15; /*    84: 0  4 */
				uint32_t   Reserved687:1;        /*    84:15  4 */
				uint32_t   Framebitratemindelta:15; /*    84:16  4 */
				uint32_t   Reserved703:1;        /*    84:31  4 */
			};                                       /*    84     4 */
			uint32_t           Value;                /*    84     4 */
		} DW21;                                          /*    84     4 */
		union {
			struct {
				uint32_t   MinFrameWsize:16;     /*    88: 0  4 */
				uint32_t   MinFrameWsizeUnit:2;  /*    88:16  4 */
				uint32_t   Reserved722:2;        /*    88:18  4 */
				uint32_t   BitstreamFormatVersion:3; /*    88:20  4 */
				uint32_t   ShowFrame:1;          /*    88:23  4 */
				uint32_t   Reserved728:8;        /*    88:24  4 */
			};                                       /*    88     4 */
			uint32_t           Value;                /*    88     4 */
		} DW22;                                          /*    88     4 */
		union {
			struct {
				uint32_t   HorizontalSizeCode:16; /*    92: 0  4 */
				uint32_t   VerticalSizeCode:16;  /*    92:16  4 */
			};                                       /*    92     4 */
			uint32_t           Value;                /*    92     4 */
		} DW23;                                          /*    92     4 */
		union {
			struct {
				uint32_t   FrameHeaderBitCount;  /*    96     4 */
			};                                       /*    96     4 */
			uint32_t           Value;                /*    96     4 */
		} DW24;                                          /*    96     4 */
		union {
			struct {
				uint32_t   FrameHeaderBinBufferQindexUpdatePointer; /*   100     4 */
			};                                       /*   100     4 */
			uint32_t           Value;                /*   100     4 */
		} DW25;                                          /*   100     4 */
		union {
			struct {
				uint32_t   FrameHeaderBinBufferLoopfilterUpdatePointer; /*   104     4 */
			};                                       /*   104     4 */
			uint32_t           Value;                /*   104     4 */
		} DW26;                                          /*   104     4 */
		union {
			struct {
				uint32_t   FrameHeaderBinBufferTokenUpdatePointer; /*   108     4 */
			};                                       /*   108     4 */
			uint32_t           Value;                /*   108     4 */
		} DW27;                                          /*   108     4 */
		union {
			struct {
				uint32_t   FrameHeaderBinBufferMvupdatePointer; /*   112     4 */
			};                                       /*   112     4 */
			uint32_t           Value;                /*   112     4 */
		} DW28;                                          /*   112     4 */
		union {
			struct {
				uint32_t   Cv0ClampValue0:4;     /*   116: 0  4 */
				uint32_t   Cv1:4;                /*   116: 4  4 */
				uint32_t   Cv2:4;                /*   116: 8  4 */
				uint32_t   Cv3:4;                /*   116:12  4 */
				uint32_t   Cv4:4;                /*   116:16  4 */
				uint32_t   Cv5:4;                /*   116:20  4 */
				uint32_t   Cv6:4;                /*   116:24  4 */
				uint32_t   ClampvaluesCv7:4;     /*   116:28  4 */
			};                                       /*   116     4 */
			uint32_t           Value;                /*   116     4 */
		} DW29;                                          /*   116     4 */
		void MFX_VP8_Encoder_CFG_CMD(class MFX_VP8_Encoder_CFG_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 30;   /*     0     0 */
		static const size_t               byteSize = 120; /*     0     0 */

		/* size: 120, cachelines: 2, members: 30, static members: 2 */
		/* last cacheline: 56 bytes */
	};

	struct MFX_VP8_BSP_BUF_BASE_ADDR_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubOpcodeB:5;         /*     0:16  4 */
				uint32_t           SubOpcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved32:6;         /*     0: 0  4 */
				uint32_t           FrameHeaderBaseAddr:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBaseAddrUpperRange:16; /*     0: 0  4 */
				uint32_t           Reserved80:16;        /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameHeaderBaseAddrAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           Reserved98:1;         /*     0: 2  4 */
				uint32_t           FrameHeaderBaseAddrTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           ForFrameheaderbaseaddrLlcEllcCacheabilityControlLellccc:2; /*     0: 5  4 */
				uint32_t           FrameHeaderBaseAddrArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved105:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved128:6;        /*     0: 0  4 */
				uint32_t           IntermediateBufferBaseAddr:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferBaseAddrUpperRange:16; /*     0: 0  4 */
				uint32_t           Reserved176:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferBaseAddrAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           Reserved194:1;        /*     0: 2  4 */
				uint32_t           IntermediateBufferBaseAddrTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           IntermediateBufferBaseAddrLlcEllcCacheabilityControlLellccc:2; /*     0: 5  4 */
				uint32_t           IntermediateBufferBaseAddrArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved201:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition1Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition2Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition3Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition4Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition5Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition6Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition7Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferPartition8Offset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IntermediateBufferMaxSize; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved512:6;        /*     0: 0  4 */
				uint32_t           FinalFrameBaseAddr:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FinalFrameBaseAddrUpperRange:16; /*     0: 0  4 */
				uint32_t           Reserved560:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FinalFrameBaseAddrAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           Reserved578:1;        /*     0: 2  4 */
				uint32_t           FinalFrameBaseAddrTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           FinalFrameBaseAddrLlcEllcCacheabilityControlLellccc:2; /*     0: 5  4 */
				uint32_t           FinalFrameBaseAddrArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved585:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Finalframebyteoffset:6; /*     0: 0  4 */
				uint32_t           Reserved614:26;       /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           StreamoutBaseAddrCacheabilityControl:2; /*     0: 0  4 */
				uint32_t           StreamoutBaseAddrGraphicsDataTypeGfdt:1; /*     0: 2  4 */
				uint32_t           Reserved643:1;        /*     0: 3  4 */
				uint32_t           StreamoutBaseAddrArbitrationPriorityControl:2; /*     0: 4  4 */
				uint32_t           StreamoutBaseAddr:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           StreamoutBaseAddrUpperRange:16; /*     0: 0  4 */
				uint32_t           Reserved688:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           StreamoutBaseAddrAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           Reserved706:1;        /*     0: 2  4 */
				uint32_t           StreamoutBaseAddrTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           StreamoutBaseAddrLlcEllcCacheabilityControlLellccc:2; /*     0: 5  4 */
				uint32_t           StreamoutBaseAddrArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved713:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CoeffProbsStreaminSurfaceCacheabilityControl:2; /*     0: 0  4 */
				uint32_t           CoeffProbsStreaminSurfaceGraphicsDataTypeGfdt:1; /*     0: 2  4 */
				uint32_t           Reserved739:1;        /*     0: 3  4 */
				uint32_t           CoeffProbsStreaminSurfaceArbitrationPriorityControl:2; /*     0: 4  4 */
				uint32_t           CoeffProbsStreaminSurface:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CoeffProbsStreaminSurfaceUpperRange:16; /*     0: 0  4 */
				uint32_t           Reserved784:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           CoeffProbsStreaminSurfaceAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           Reserved802:1;        /*     0: 2  4 */
				uint32_t           CoeffProbsStreaminSurfaceTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           CoeffProbsStreaminSurfaceLlcEllcCacheabilityControlLellccc:2; /*     0: 5  4 */
				uint32_t           CoeffProbsStreaminSurfaceArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved809:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           TokenStatisticsSurfaceCacheabilityControl:2; /*     0: 0  4 */
				uint32_t           TokenStatisticsSurfaceGraphicsDataTypeGfdt:1; /*     0: 2  4 */
				uint32_t           Reserved835:1;        /*     0: 3  4 */
				uint32_t           FrameHeaderBaseAddrArbitrationPriorityControl:2; /*     0: 4  4 */
				uint32_t           TokenStatisticsSurface:26; /*     0: 6  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           TokenStatisticsSurface:16; /*     0: 0  4 */
				uint32_t           Reserved880:16;       /*     0:16  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           TokenStatisticsSurfaceAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           TokenStatisticsSurface:1; /*     0: 2  4 */
				uint32_t           TokenStatisticsSurfaceTargetCacheTc:2; /*     0: 3  4 */
				uint32_t           MemoryTypeLlcEllcCacheabilityControlLellcccForCoeffprobsStreaminSurface:2; /*     0: 5  4 */
				uint32_t           TokenStatisticsSurfaceArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved905:23;       /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint64_t           MpcRowstoreSurfaceCacheabilityControl:2; /*     0: 0  8 */
				uint64_t           MpcRowstoreSurfaceGraphicsDataTypeGfdt:1; /*     0: 2  8 */
				uint64_t           Reserved931:1;        /*     0: 3  8 */
				uint64_t           MpcRowstoreBaseAddrArbitrationPriorityControl:2; /*     0: 4  8 */
				uint64_t           MpcRowstoreSurfaceAddressLow:58; /*     0: 6  8 */
			};                                               /*     0     8 */
			uint32_t                   Value[2];             /*     0     8 */
		};

		union {
			struct {
				uint32_t           MpcRowstoreSurfaceAgeForQuadlruAge:2; /*     0: 0  4 */
				uint32_t           MpcRowstoreSurface:1; /*     0: 2  4 */
				uint32_t           MpcRowstoreTargetCache:2; /*     0: 3  4 */
				uint32_t           MpcRowstoreMemoryTypeLlcEllcCacheabilityControl:2; /*     0: 5  4 */
				uint32_t           MpcRowstoreArbitrationPriorityControl:2; /*     0: 7  4 */
				uint32_t           Reserved1001:23;      /*     0: 9  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   SubOpcodeB:5;         /*     0:16  4 */
				uint32_t   SubOpcodeA:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Reserved32:6;         /*     4: 0  4 */
				uint32_t   FrameHeaderBaseAddr:26; /*     4: 6  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   FrameHeaderBaseAddrUpperRange:16; /*     8: 0  4 */
				uint32_t   Reserved80:16;        /*     8:16  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   FrameHeaderBaseAddrAgeForQuadlruAge:2; /*    12: 0  4 */
				uint32_t   Reserved98:1;         /*    12: 2  4 */
				uint32_t   FrameHeaderBaseAddrTargetCacheTc:2; /*    12: 3  4 */
				uint32_t   ForFrameheaderbaseaddrLlcEllcCacheabilityControlLellccc:2; /*    12: 5  4 */
				uint32_t   FrameHeaderBaseAddrArbitrationPriorityControl:2; /*    12: 7  4 */
				uint32_t   Reserved105:23;       /*    12: 9  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   Reserved128:6;        /*    16: 0  4 */
				uint32_t   IntermediateBufferBaseAddr:26; /*    16: 6  4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   IntermediateBufferBaseAddrUpperRange:16; /*    20: 0  4 */
				uint32_t   Reserved176:16;       /*    20:16  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   IntermediateBufferBaseAddrAgeForQuadlruAge:2; /*    24: 0  4 */
				uint32_t   Reserved194:1;        /*    24: 2  4 */
				uint32_t   IntermediateBufferBaseAddrTargetCacheTc:2; /*    24: 3  4 */
				uint32_t   IntermediateBufferBaseAddrLlcEllcCacheabilityControlLellccc:2; /*    24: 5  4 */
				uint32_t   IntermediateBufferBaseAddrArbitrationPriorityControl:2; /*    24: 7  4 */
				uint32_t   Reserved201:23;       /*    24: 9  4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition1Offset; /*    28     4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition2Offset; /*    32     4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition3Offset; /*    36     4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition4Offset; /*    40     4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition5Offset; /*    44     4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition6Offset; /*    48     4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition7Offset; /*    52     4 */
			};                                       /*    52     4 */
			uint32_t           Value;                /*    52     4 */
		} DW13;                                          /*    52     4 */
		union {
			struct {
				uint32_t   IntermediateBufferPartition8Offset; /*    56     4 */
			};                                       /*    56     4 */
			uint32_t           Value;                /*    56     4 */
		} DW14;                                          /*    56     4 */
		union {
			struct {
				uint32_t   IntermediateBufferMaxSize; /*    60     4 */
			};                                       /*    60     4 */
			uint32_t           Value;                /*    60     4 */
		} DW15;                                          /*    60     4 */
		union {
			struct {
				uint32_t   Reserved512:6;        /*    64: 0  4 */
				uint32_t   FinalFrameBaseAddr:26; /*    64: 6  4 */
			};                                       /*    64     4 */
			uint32_t           Value;                /*    64     4 */
		} DW16;                                          /*    64     4 */
		union {
			struct {
				uint32_t   FinalFrameBaseAddrUpperRange:16; /*    68: 0  4 */
				uint32_t   Reserved560:16;       /*    68:16  4 */
			};                                       /*    68     4 */
			uint32_t           Value;                /*    68     4 */
		} DW17;                                          /*    68     4 */
		union {
			struct {
				uint32_t   FinalFrameBaseAddrAgeForQuadlruAge:2; /*    72: 0  4 */
				uint32_t   Reserved578:1;        /*    72: 2  4 */
				uint32_t   FinalFrameBaseAddrTargetCacheTc:2; /*    72: 3  4 */
				uint32_t   FinalFrameBaseAddrLlcEllcCacheabilityControlLellccc:2; /*    72: 5  4 */
				uint32_t   FinalFrameBaseAddrArbitrationPriorityControl:2; /*    72: 7  4 */
				uint32_t   Reserved585:23;       /*    72: 9  4 */
			};                                       /*    72     4 */
			uint32_t           Value;                /*    72     4 */
		} DW18;                                          /*    72     4 */
		union {
			struct {
				uint32_t   Finalframebyteoffset:6; /*    76: 0  4 */
				uint32_t   Reserved614:26;       /*    76: 6  4 */
			};                                       /*    76     4 */
			uint32_t           Value;                /*    76     4 */
		} DW19;                                          /*    76     4 */
		union {
			struct {
				uint32_t   StreamoutBaseAddrCacheabilityControl:2; /*    80: 0  4 */
				uint32_t   StreamoutBaseAddrGraphicsDataTypeGfdt:1; /*    80: 2  4 */
				uint32_t   Reserved643:1;        /*    80: 3  4 */
				uint32_t   StreamoutBaseAddrArbitrationPriorityControl:2; /*    80: 4  4 */
				uint32_t   StreamoutBaseAddr:26; /*    80: 6  4 */
			};                                       /*    80     4 */
			uint32_t           Value;                /*    80     4 */
		} DW20;                                          /*    80     4 */
		union {
			struct {
				uint32_t   StreamoutBaseAddrUpperRange:16; /*    84: 0  4 */
				uint32_t   Reserved688:16;       /*    84:16  4 */
			};                                       /*    84     4 */
			uint32_t           Value;                /*    84     4 */
		} DW21;                                          /*    84     4 */
		union {
			struct {
				uint32_t   StreamoutBaseAddrAgeForQuadlruAge:2; /*    88: 0  4 */
				uint32_t   Reserved706:1;        /*    88: 2  4 */
				uint32_t   StreamoutBaseAddrTargetCacheTc:2; /*    88: 3  4 */
				uint32_t   StreamoutBaseAddrLlcEllcCacheabilityControlLellccc:2; /*    88: 5  4 */
				uint32_t   StreamoutBaseAddrArbitrationPriorityControl:2; /*    88: 7  4 */
				uint32_t   Reserved713:23;       /*    88: 9  4 */
			};                                       /*    88     4 */
			uint32_t           Value;                /*    88     4 */
		} DW22;                                          /*    88     4 */
		union {
			struct {
				uint32_t   CoeffProbsStreaminSurfaceCacheabilityControl:2; /*    92: 0  4 */
				uint32_t   CoeffProbsStreaminSurfaceGraphicsDataTypeGfdt:1; /*    92: 2  4 */
				uint32_t   Reserved739:1;        /*    92: 3  4 */
				uint32_t   CoeffProbsStreaminSurfaceArbitrationPriorityControl:2; /*    92: 4  4 */
				uint32_t   CoeffProbsStreaminSurface:26; /*    92: 6  4 */
			};                                       /*    92     4 */
			uint32_t           Value;                /*    92     4 */
		} DW23;                                          /*    92     4 */
		union {
			struct {
				uint32_t   CoeffProbsStreaminSurfaceUpperRange:16; /*    96: 0  4 */
				uint32_t   Reserved784:16;       /*    96:16  4 */
			};                                       /*    96     4 */
			uint32_t           Value;                /*    96     4 */
		} DW24;                                          /*    96     4 */
		union {
			struct {
				uint32_t   CoeffProbsStreaminSurfaceAgeForQuadlruAge:2; /*   100: 0  4 */
				uint32_t   Reserved802:1;        /*   100: 2  4 */
				uint32_t   CoeffProbsStreaminSurfaceTargetCacheTc:2; /*   100: 3  4 */
				uint32_t   CoeffProbsStreaminSurfaceLlcEllcCacheabilityControlLellccc:2; /*   100: 5  4 */
				uint32_t   CoeffProbsStreaminSurfaceArbitrationPriorityControl:2; /*   100: 7  4 */
				uint32_t   Reserved809:23;       /*   100: 9  4 */
			};                                       /*   100     4 */
			uint32_t           Value;                /*   100     4 */
		} DW25;                                          /*   100     4 */
		union {
			struct {
				uint32_t   TokenStatisticsSurfaceCacheabilityControl:2; /*   104: 0  4 */
				uint32_t   TokenStatisticsSurfaceGraphicsDataTypeGfdt:1; /*   104: 2  4 */
				uint32_t   Reserved835:1;        /*   104: 3  4 */
				uint32_t   FrameHeaderBaseAddrArbitrationPriorityControl:2; /*   104: 4  4 */
				uint32_t   TokenStatisticsSurface:26; /*   104: 6  4 */
			};                                       /*   104     4 */
			uint32_t           Value;                /*   104     4 */
		} DW26;                                          /*   104     4 */
		union {
			struct {
				uint32_t   TokenStatisticsSurface:16; /*   108: 0  4 */
				uint32_t   Reserved880:16;       /*   108:16  4 */
			};                                       /*   108     4 */
			uint32_t           Value;                /*   108     4 */
		} DW27;                                          /*   108     4 */
		union {
			struct {
				uint32_t   TokenStatisticsSurfaceAgeForQuadlruAge:2; /*   112: 0  4 */
				uint32_t   TokenStatisticsSurface:1; /*   112: 2  4 */
				uint32_t   TokenStatisticsSurfaceTargetCacheTc:2; /*   112: 3  4 */
				uint32_t   MemoryTypeLlcEllcCacheabilityControlLellcccForCoeffprobsStreaminSurface:2; /*   112: 5  4 */
				uint32_t   TokenStatisticsSurfaceArbitrationPriorityControl:2; /*   112: 7  4 */
				uint32_t   Reserved905:23;       /*   112: 9  4 */
			};                                       /*   112     4 */
			uint32_t           Value;                /*   112     4 */
		} DW28;                                          /*   112     4 */
		union {
			struct {
				uint64_t   MpcRowstoreSurfaceCacheabilityControl:2; /*   116: 0  8 */
				uint64_t   MpcRowstoreSurfaceGraphicsDataTypeGfdt:1; /*   116: 2  8 */
				uint64_t   Reserved931:1;        /*   116: 3  8 */
				uint64_t   MpcRowstoreBaseAddrArbitrationPriorityControl:2; /*   116: 4  8 */
				uint64_t   MpcRowstoreSurfaceAddressLow:58; /*   116: 6  8 */
			};                                       /*   116     8 */
			uint32_t           Value[2];             /*   116     8 */
		} DW29_30;                                       /*   116     8 */
		union {
			struct {
				uint32_t   MpcRowstoreSurfaceAgeForQuadlruAge:2; /*   124: 0  4 */
				uint32_t   MpcRowstoreSurface:1; /*   124: 2  4 */
				uint32_t   MpcRowstoreTargetCache:2; /*   124: 3  4 */
				uint32_t   MpcRowstoreMemoryTypeLlcEllcCacheabilityControl:2; /*   124: 5  4 */
				uint32_t   MpcRowstoreArbitrationPriorityControl:2; /*   124: 7  4 */
				uint32_t   Reserved1001:23;      /*   124: 9  4 */
			};                                       /*   124     4 */
			uint32_t           Value;                /*   124     4 */
		} DW31;                                          /*   124     4 */
		void MFX_VP8_BSP_BUF_BASE_ADDR_STATE_CMD(class MFX_VP8_BSP_BUF_BASE_ADDR_STATE_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 32;   /*     0     0 */
		static const size_t               byteSize = 128; /*     0     0 */

		/* size: 128, cachelines: 2, members: 31, static members: 2 */
	} __attribute__((__packed__));

	struct MFD_VP8_BSD_OBJECT_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           Subopcodeb:5;         /*     0:16  4 */
				uint32_t           Subopcodea:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Partition0FirstmbbitoffsetFromFrameHeader:3; /*     0: 0  4 */
				uint32_t           Reserved35:1;         /*     0: 3  4 */
				uint32_t           CodedNumOfCoeffTokenPartitions:2; /*     0: 4  4 */
				uint32_t           Reserved38:2;         /*     0: 6  4 */
				uint32_t           Partition0CpbacEntropyRange:8; /*     0: 8  4 */
				uint32_t           Partition0CpbacEntropyCount:5; /*     0:16  4 */
				uint32_t           Reserved53:11;        /*     0:21  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved64:24;        /*     0: 0  4 */
				uint32_t           Partition0CpbacEntropyValue:8; /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition0DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved120:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition0DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition1DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved184:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition1DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition2DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved248:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition2DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition3DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved312:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition3DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition4DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved376:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition4DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition5DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved440:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition5DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition6DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved504:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition6DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition7DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved568:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition7DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition8DataLength:24; /*     0: 0  4 */
				uint32_t           Reserved632:8;        /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           IndirectPartition8DataStartOffset; /*     0     4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           Reserved672:8;        /*     0: 0  4 */
				uint32_t           MbHeaderErrorHandling:1; /*     0: 8  4 */
				uint32_t           Reserved681:1;        /*     0: 9  4 */
				uint32_t           EntropyErrorHandling:1; /*     0:10  4 */
				uint32_t           Reserved683:1;        /*     0:11  4 */
				uint32_t           MprErrorMvOutOfRangeHandling:1; /*     0:12  4 */
				uint32_t           Reserved685:1;        /*     0:13  4 */
				uint32_t           BsdprematurecompleteErrorHandling:1; /*     0:14  4 */
				uint32_t           Reserved687:1;        /*     0:15  4 */
				uint32_t           ConcealPicIdConcealmentPictureId:2; /*     0:16  4 */
				uint32_t           Reserved690:13;       /*     0:18  4 */
				uint32_t           ConcealmentMethod:1;  /*     0:31  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t   DwordLength:12;       /*     0: 0  4 */
				uint32_t   Reserved12:4;         /*     0:12  4 */
				uint32_t   Subopcodeb:5;         /*     0:16  4 */
				uint32_t   Subopcodea:3;         /*     0:21  4 */
				uint32_t   MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t   Pipeline:2;           /*     0:27  4 */
				uint32_t   CommandType:3;        /*     0:29  4 */
			};                                       /*     0     4 */
			uint32_t           Value;                /*     0     4 */
		} DW0;                                           /*     0     4 */
		union {
			struct {
				uint32_t   Partition0FirstmbbitoffsetFromFrameHeader:3; /*     4: 0  4 */
				uint32_t   Reserved35:1;         /*     4: 3  4 */
				uint32_t   CodedNumOfCoeffTokenPartitions:2; /*     4: 4  4 */
				uint32_t   Reserved38:2;         /*     4: 6  4 */
				uint32_t   Partition0CpbacEntropyRange:8; /*     4: 8  4 */
				uint32_t   Partition0CpbacEntropyCount:5; /*     4:16  4 */
				uint32_t   Reserved53:11;        /*     4:21  4 */
			};                                       /*     4     4 */
			uint32_t           Value;                /*     4     4 */
		} DW1;                                           /*     4     4 */
		union {
			struct {
				uint32_t   Reserved64:24;        /*     8: 0  4 */
				uint32_t   Partition0CpbacEntropyValue:8; /*     8:24  4 */
			};                                       /*     8     4 */
			uint32_t           Value;                /*     8     4 */
		} DW2;                                           /*     8     4 */
		union {
			struct {
				uint32_t   IndirectPartition0DataLength:24; /*    12: 0  4 */
				uint32_t   Reserved120:8;        /*    12:24  4 */
			};                                       /*    12     4 */
			uint32_t           Value;                /*    12     4 */
		} DW3;                                           /*    12     4 */
		union {
			struct {
				uint32_t   IndirectPartition0DataStartOffset; /*    16     4 */
			};                                       /*    16     4 */
			uint32_t           Value;                /*    16     4 */
		} DW4;                                           /*    16     4 */
		union {
			struct {
				uint32_t   IndirectPartition1DataLength:24; /*    20: 0  4 */
				uint32_t   Reserved184:8;        /*    20:24  4 */
			};                                       /*    20     4 */
			uint32_t           Value;                /*    20     4 */
		} DW5;                                           /*    20     4 */
		union {
			struct {
				uint32_t   IndirectPartition1DataStartOffset; /*    24     4 */
			};                                       /*    24     4 */
			uint32_t           Value;                /*    24     4 */
		} DW6;                                           /*    24     4 */
		union {
			struct {
				uint32_t   IndirectPartition2DataLength:24; /*    28: 0  4 */
				uint32_t   Reserved248:8;        /*    28:24  4 */
			};                                       /*    28     4 */
			uint32_t           Value;                /*    28     4 */
		} DW7;                                           /*    28     4 */
		union {
			struct {
				uint32_t   IndirectPartition2DataStartOffset; /*    32     4 */
			};                                       /*    32     4 */
			uint32_t           Value;                /*    32     4 */
		} DW8;                                           /*    32     4 */
		union {
			struct {
				uint32_t   IndirectPartition3DataLength:24; /*    36: 0  4 */
				uint32_t   Reserved312:8;        /*    36:24  4 */
			};                                       /*    36     4 */
			uint32_t           Value;                /*    36     4 */
		} DW9;                                           /*    36     4 */
		union {
			struct {
				uint32_t   IndirectPartition3DataStartOffset; /*    40     4 */
			};                                       /*    40     4 */
			uint32_t           Value;                /*    40     4 */
		} DW10;                                          /*    40     4 */
		union {
			struct {
				uint32_t   IndirectPartition4DataLength:24; /*    44: 0  4 */
				uint32_t   Reserved376:8;        /*    44:24  4 */
			};                                       /*    44     4 */
			uint32_t           Value;                /*    44     4 */
		} DW11;                                          /*    44     4 */
		union {
			struct {
				uint32_t   IndirectPartition4DataStartOffset; /*    48     4 */
			};                                       /*    48     4 */
			uint32_t           Value;                /*    48     4 */
		} DW12;                                          /*    48     4 */
		union {
			struct {
				uint32_t   IndirectPartition5DataLength:24; /*    52: 0  4 */
				uint32_t   Reserved440:8;        /*    52:24  4 */
			};                                       /*    52     4 */
			uint32_t           Value;                /*    52     4 */
		} DW13;                                          /*    52     4 */
		union {
			struct {
				uint32_t   IndirectPartition5DataStartOffset; /*    56     4 */
			};                                       /*    56     4 */
			uint32_t           Value;                /*    56     4 */
		} DW14;                                          /*    56     4 */
		union {
			struct {
				uint32_t   IndirectPartition6DataLength:24; /*    60: 0  4 */
				uint32_t   Reserved504:8;        /*    60:24  4 */
			};                                       /*    60     4 */
			uint32_t           Value;                /*    60     4 */
		} DW15;                                          /*    60     4 */
		union {
			struct {
				uint32_t   IndirectPartition6DataStartOffset; /*    64     4 */
			};                                       /*    64     4 */
			uint32_t           Value;                /*    64     4 */
		} DW16;                                          /*    64     4 */
		union {
			struct {
				uint32_t   IndirectPartition7DataLength:24; /*    68: 0  4 */
				uint32_t   Reserved568:8;        /*    68:24  4 */
			};                                       /*    68     4 */
			uint32_t           Value;                /*    68     4 */
		} DW17;                                          /*    68     4 */
		union {
			struct {
				uint32_t   IndirectPartition7DataStartOffset; /*    72     4 */
			};                                       /*    72     4 */
			uint32_t           Value;                /*    72     4 */
		} DW18;                                          /*    72     4 */
		union {
			struct {
				uint32_t   IndirectPartition8DataLength:24; /*    76: 0  4 */
				uint32_t   Reserved632:8;        /*    76:24  4 */
			};                                       /*    76     4 */
			uint32_t           Value;                /*    76     4 */
		} DW19;                                          /*    76     4 */
		union {
			struct {
				uint32_t   IndirectPartition8DataStartOffset; /*    80     4 */
			};                                       /*    80     4 */
			uint32_t           Value;                /*    80     4 */
		} DW20;                                          /*    80     4 */
		union {
			struct {
				uint32_t   Reserved672:8;        /*    84: 0  4 */
				uint32_t   MbHeaderErrorHandling:1; /*    84: 8  4 */
				uint32_t   Reserved681:1;        /*    84: 9  4 */
				uint32_t   EntropyErrorHandling:1; /*    84:10  4 */
				uint32_t   Reserved683:1;        /*    84:11  4 */
				uint32_t   MprErrorMvOutOfRangeHandling:1; /*    84:12  4 */
				uint32_t   Reserved685:1;        /*    84:13  4 */
				uint32_t   BsdprematurecompleteErrorHandling:1; /*    84:14  4 */
				uint32_t   Reserved687:1;        /*    84:15  4 */
				uint32_t   ConcealPicIdConcealmentPictureId:2; /*    84:16  4 */
				uint32_t   Reserved690:13;       /*    84:18  4 */
				uint32_t   ConcealmentMethod:1;  /*    84:31  4 */
			};                                       /*    84     4 */
			uint32_t           Value;                /*    84     4 */
		} DW21;                                          /*    84     4 */
		void MFD_VP8_BSD_OBJECT_CMD(class MFD_VP8_BSD_OBJECT_CMD *);


		/* Bitfield combined with previous fields */

		static const size_t               dwSize = 22;   /*     0     0 */
		static const size_t               byteSize = 88; /*     0     0 */

		/* size: 88, cachelines: 2, members: 22, static members: 2 */
		/* last cacheline: 24 bytes */
	};

	struct MFX_VP8_PIC_STATE_CMD {
		union {
			struct {
				uint32_t           DwordLength:12;       /*     0: 0  4 */
				uint32_t           Reserved12:4;         /*     0:12  4 */
				uint32_t           SubOpcodeB:5;         /*     0:16  4 */
				uint32_t           SubOpcodeA:3;         /*     0:21  4 */
				uint32_t           MediaCommandOpcode:3; /*     0:24  4 */
				uint32_t           Pipeline:2;           /*     0:27  4 */
				uint32_t           CommandType:3;        /*     0:29  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           FrameWidthMinus1:8;   /*     0: 0  4 */
				uint32_t           Reserved40:8;         /*     0: 8  4 */
				uint32_t           FrameHeightMinus1:8;  /*     0:16  4 */
				uint32_t           Reserved56:8;         /*     0:24  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           McFilterSelect:1;     /*     0: 0  4 */
				uint32_t           ChromaFullPixelMcFilterMode:1; /*     0: 1  4 */
				uint32_t           Reserved66:2;         /*     0: 2  4 */
				uint32_t           Dblkfiltertype:1;     /*     0: 4  4 */
				uint32_t           Skeyframeflag:1;      /*     0: 5  4 */
				uint32_t           SegmentationIdStreamoutEnable:1; /*     0: 6  4 */
				uint32_t           SegmentationIdStreaminEnable:1; /*     0: 7  4 */
				uint32_t           SegmentEnableFlag:1;  /*     0: 8  4 */
				uint32_t           UpdateMbsegmentMapFlag:1; /*     0: 9  4 */
				uint32_t           MbNocoeffSkipflag:1;  /*     0:10  4 */
				uint32_t           ModeReferenceLoopFilterDeltaEnabled:1; /*     0:11  4 */
				uint32_t           GoldenRefPictureMvSignbiasFlag:1; /*     0:12  4 */
				uint32_t           AlternateRefPicMvSignbiasFlag:1; /*     0:13  4 */
				uint32_t           Reserved78:2;         /*     0:14  4 */
				uint32_t           DeblockSharpnessLevel:3; /*     0:16  4 */
				uint32_t           Reserved83:5;         /*     0:19  4 */
				uint32_t           Log2NumOfPartition:2; /*     0:24  4 */
				uint32_t           Reserved90:6;         /*     0:26  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           DblkfilterlevelForSegment0:6; /*     0: 0  4 */
				uint32_t           Reserved102:2;        /*     0: 6  4 */
				uint32_t           DblkfilterlevelForSegment1:6; /*     0: 8  4 */
				uint32_t           Reserved110:2;        /*     0:14  4 */
				uint32_t           DblkfilterlevelForSegment2:6; /*     0:16  4 */
				uint32_t           Reserved118:2;        /*     0:22  4 */
				uint32_t           DblkfilterlevelForSegment3:6; /*     0:24  4 */
				uint32_t           Reserved126:2;        /*     0:30  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue0Blocktype0Y1Dc:9; /*     0: 0  4 */
				uint32_t           Reserved137:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue0Blocktype1Y1Ac:9; /*     0:16  4 */
				uint32_t           Reserved153:7;        /*     0:25  4 */
			} dec;                                           /*     0     4 */
			struct {
				uint32_t           Seg0Qindex:7;         /*     0: 0  4 */
				uint32_t           Reserved135:1;        /*     0: 7  4 */
				uint32_t           Seg1Qindex:7;         /*     0: 8  4 */
				uint32_t           Reserved143:1;        /*     0:15  4 */
				uint32_t           Seg2Qindex:7;         /*     0:16  4 */
				uint32_t           Reserved151:1;        /*     0:23  4 */
				uint32_t           Seg3Qindex:7;         /*     0:24  4 */
				uint32_t           Reserved159:1;        /*     0:31  4 */
			} enc;                                           /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue0Blocktype2Uvdc:9; /*     0: 0  4 */
				uint32_t           Reserved169:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue0Blocktype3Uvac:9; /*     0:16  4 */
				uint32_t           Reserved185:7;        /*     0:25  4 */
			} dec;                                           /*     0     4 */
			struct {
				uint32_t           Y2DcQindexDelta:4;    /*     0: 0  4 */
				uint32_t           Y2AcQindexDeltaSign:1; /*     0: 4  4 */
				uint32_t           Reserved165:3;        /*     0: 5  4 */
				uint32_t           Y2AcQindexDelta:4;    /*     0: 8  4 */
				uint32_t           Y2AcQindexSign:1;     /*     0:12  4 */
				uint32_t           Reserved173:3;        /*     0:13  4 */
				uint32_t           UvdcQindexDelta:4;    /*     0:16  4 */
				uint32_t           UvdcQindexDeltaSign:1; /*     0:20  4 */
				uint32_t           Reserved181:3;        /*     0:21  4 */
				uint32_t           UvacQindexdelta:4;    /*     0:24  4 */
				uint32_t           UvacQindexDeltaSign:1; /*     0:28  4 */
				uint32_t           Reserved189:3;        /*     0:29  4 */
			} enc;                                           /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue0Blocktype4Y2Dc:9; /*     0: 0  4 */
				uint32_t           Reserved201:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue0Blocktype5Y2Ac:9; /*     0:16  4 */
				uint32_t           Reserved217:7;        /*     0:25  4 */
			} dec;                                           /*     0     4 */
			struct {
				uint32_t           Y1DcQindexDelta:4;    /*     0: 0  4 */
				uint32_t           Y1DcQindexDeltaSign:1; /*     0: 4  4 */
				uint32_t           Reserved197:27;       /*     0: 5  4 */
			} enc;                                           /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue1Blocktype0Y1Dc:9; /*     0: 0  4 */
				uint32_t           Reserved233:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue1Blocktype1Y1Ac:9; /*     0:16  4 */
				uint32_t           Reserved249:7;        /*     0:25  4 */
			} dec;                                           /*     0     4 */
			struct {
				uint32_t           ClampQindexLow:7;     /*     0: 0  4 */
				uint32_t           Reserved231:1;        /*     0: 7  4 */
				uint32_t           ClampQindexHigh:7;    /*     0: 8  4 */
				uint32_t           Reserved239:17;       /*     0:15  4 */
			} enc;                                           /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue1Blocktype2Uvdc:9; /*     0: 0  4 */
				uint32_t           Reserved265:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue1Blocktype3Uvac:9; /*     0:16  4 */
				uint32_t           Reserved281:7;        /*     0:25  4 */
			};                                               /*     0     4 */
			uint32_t                   Value;                /*     0     4 */
		};

		union {
			struct {
				uint32_t           QuantizerValue1Blocktype4Y2Dc:9; /*     0: 0  4 */
				uint32_t           Reserved297:7;        /*     0: 9  4 */
				uint32_t           QuantizerValue1Blocktype5Y2Ac:9; /*     0:16  4 */
				uint32_t           Reserved313:7;        /*     0:25  4 */
